[
    {
        "id":1,
        "name":"Oyster Mushroom",
        "imageName":"pinkOyster",
        "description":"Oyster Mushrooms are easy to grow on a variety of substrates, from straw, sawdust, and coffee grounds to logs or grow bags. The method outlined below involves using 5-gallon buckets to grow the Oyster Mushrooms, which works well for beginners and small operations. Tap on the steps below to expand them and look at the references for more in depth instructions.",
        "category":"beginner",
        "instructions":["Straw, 5-gallon bucket, drill, large pot/pressure cooker, grain/sawdust oyster spawn", "Fill a large pot or pressure cooker about 2/3rds full with water. Bring the temperature between 150-185 degrees fahrenheit, then fill the pot with straw so that it is not overflowing with water (you can put the straw in a breathable bag beforehand or strain the straw out later). Place the lid on and let it cook for an hour.", "Take the straw out of the pot and let it drain and dry for a few hours, or preferably overnight. The straw should be damp and moist. Then drill ¼ -½ inch holes around the whole bucket. This is where the mushrooms will grow from, so make sure you have plenty.", "Fill the bucket with layers of straw and oyster spawn. Put a few inches of straw for every layer of oyster spawn, and fit as much as you can into the bucket. Place the lid on top and let it sit in a cool place to colonize for 2-3 weeks, making sure it doesn't dry out and that the mycelium is spreading throughout the bucket.", "Once you see the mushrooms start to pin, move them outside, to a grow room, or somewhere that has good airflow and high humidity. This depends on where you live, so do your own research. Keep the mushrooms moist while they grow and harvest when they are the desirable size. This method should produce multiple flushes."],
        "link1":"https://grocycle.com/how-to-set-up-a-low-tech-mushroom-farm/",
        "link2":"https://www.youtube.com/watch?v=r10GqUKmSbc",
        "link3":"https://learn.freshcap.com/growing/bucket-grow/",
        "link4":"https://www.youtube.com/watch?v=8Zi9GnE1HRA",
        "storeLink":""
    },
    {
        "id":2,
        "name":"Shiitake",
        "imageName":"shiitake",
        "description":"Similar to the Oyster Mushroom, Shiitake Mushrooms can grow on many substrates, but in this overview we will be going over how to grow them on logs. It will take a few months before they start fruiting, but once they start you will get multiple flushes per year for multiple years. The logs are stored outside and sealed with wax after being inoculated.",
        "category":"beginner",
        "instructions":["Logs, shiitake spawn plugs, drill, wax/paraffin", "Cut logs 3-9 inches thick and several feet long when they are dormant, so around February to around May. Try to use hardwood trees, preferably oak, but maple, birch, poplar, aspen, and beech have been used. Remember that thicker the log the longer it will take to colonize. After you cut the logs, let them sit for a few weeks or the spawn plugs will have difficulty due to tannic acid levels.", "Drill holes all around the log using a drill bit. A 3-4 foot log should require 50-60 spawn plugs if you drill every three inches in multiple rows. The holes must be large enough so that most of the spawn plug can fit inside, so drill roughly ½ an inch deep with the appropriate drill bit. Hammer the plugs in fully and seal the hole with wax to keep other fungi from contaminating your log. You can also seal the ends of the log to be extra careful.", "Place the log where it gets minimal direct sunlight. It is important for your location to be humid and have fresh air flow. You can stack the logs or lean them against each other. Some people put tarps over the logs while the mycelium first begins to spread, as the early fungal growth can be affected by direct sun, too much wind, or low humidity. Feel free to water the logs if they start to dry out.", "After at least 8 months (it may take up to two years) you will see mushrooms pinning from the logs. Expect 1-2 flushes a year unless you shock the logs to increase production. For shocks, soak the logs in cold water for a day to see mushrooms pinning within a week. Shocking growth only works after the log is fully colonized."],
        "link1":"https://www.youtube.com/watch?v=v9L9lqzI64M",
        "link2":"https://pss.uvm.edu/ppp/articles/shiitake.html#:~:text=Unlike%20many%20mushrooms%20which%20grow,lengths%20for%20the%20thicker%20logs",
        "link3":"https://web.archive.org/web/20071225055034/http://www.thefarm.org/etc/shiitake.html",
        "link4":"https://www.youtube.com/watch?v=eDmm52FXfZ4",
        "storeLink":""
    },
    {
        "id":3,
        "name":"Lion's Mane",
        "imageName":"Lions Mane",
        "description":"The Lion's Mane mushroom can be grown on several different kinds of substrates and is slightly more difficult to grow when compared to Oyster or Shiitake mushrooms. In this example we will be using fruiting blocks to grow them indoors. This method produces multiple flushes and relatively quick grow times.",
        "category":"difficult",
        "instructions":["Grain/sawdust Lions Mane spawn, mushroom grow bags, mushrooms, pressure cooker, water", "Historically successful Lion’s Mane substrates are 50/50 mixes of hardwood sawdust/soybean hulls or hardwood fuel pellets/wheat bran (although some people add more ingredients) mixed with water. It is strongly advised to follow a step-by-step tutorial when it comes to making your fruiting blocks to avoid contamination. Check out the first link in the references.", "After your fruiting block is made, with the substrate in the fruiting bag, it is time to sterilize it before mixing in the spawn. This can be done by pressure cooking it for 2.5 hours.", "In a sterile location (preferably under a flow hood) mix your spawn thoroughly in with the substrate. Seal the grow bag and place it somewhere dark for a few weeks while the mycelium spreads.", "When you see the mycelium begin to fruit behind the plastic, place the grow bag in a fruiting room and cut the plastic where the Lion’s Mane mushrooms are beginning to grow. Do not wait until the bag is completely colonized. Be ready to harvest in about a week, and expect multiple flushes."],
        "link1":"https://www.yonathanreches.com/how-to-make-supplemented-sawdust-blocks/",
        "link2":"https://morningchores.com/growing-lions-mane-mushrooms/",
        "link3":"https://www.youtube.com/watch?v=S4GODFy3Vcg",
        "link4":"https://www.youtube.com/watch?v=KTLr50RlhT0",
        "storeLink":""
    },
    {
        "id":4,
        "name":"Reishi",
        "imageName":"reishi",
        "description":"Reishi Mushrooms are known for their medicinal uses and can be grown on logs with grow bags. These instructions are for fruiting blocks specifically, as they take the least amount of time until harvest. This grow method is just like the Lion’s Mane instructions, with only a few small differences.",
        "category":"difficult",
        "instructions":["Reishi spawn, autoclave mushroom bag, pressure cooker, water, your choice of substrate", "The first step is to build the fruiting block. Similar to the Lion’s Mane, it is recommended to look at multiple sources and determine what ingredients are best for your situation. Reishi mushrooms typically do well with hardwood sawdust. A 4:1 sawdust to bran ratio works well along with a 2:1:1:1 mixture of hardwood sawdust, woodchips, coco coir, and shredded newspaper.", "After your fruiting block is made, with the substrate mix in the fruiting bag, it is time to sterilize it before mixing in the spawn. This can be done by pressure cooking the autoclave bag for 2-2.5 hours in a pressure cooker.", "In a sterile location (preferably under a flow hood) mix your spawn thoroughly in with the substrate. Seal the grow bag and place it somewhere dark for a few weeks while the mycelium spreads.", "Cut the top of the bag off after you see Reishi antlers begin to grow. Make sure the bag is fully colonized with mycelium or you risk contamination. Set the block in a humid fruiting location and harvest when they are at the desired size."],
        "link1":"https://www.youtube.com/watch?v=cUdeL6S8YWU",
        "link2":"https://learn.freshcap.com/growing/candidates-for-cultivation-the-reishi-mushroom/",
        "link3":"https://www.fieldforest.net/product/reishi-on-logs-instruction-sheet/instruction-sheets",
        "link4":"https://www.youtube.com/watch?v=ytbG4jGgoek",
        "storeLink":""
    },
    {
        "id":5,
        "name":"Enoki",
        "imageName":"enoki",
        "description":"Enoki Mushrooms grow in tall, white clusters and are easy to grow at home in jars. They are especailly popular in Asian culture and have numerous health benefits. Each bottle should give multiple fulushes, typically every 2-3 weeks after the first harvest.",
        "category":"beginner",
        "instructions":["Enoki spawn, jars/bottles, pressure cooker, water, your choice of substrate", "Substrate depends on your preference and availability of ingredients. Popular Enoki substrates include hardwood sawdust or a 1:1:1 mix of corn cob, rice bran, and sugar beet pulp. Bran and soy hulls can also be used, but using substrate that is from hardwood is optimal.", "Enoki will grow in any kind of jar as long as it has a sealable lid. Mason jars are recommended. Cook your jars in hot water for 10-15 minutes to sterilize them, and then hydrate your substrate so it is moist. Fill the jars with substrate and then seal them. Pressure cook the jars on high for at least 90 minutes.", "Remove the jars from your pressure cooker and pour a few grams of enoki spawn on the top of each jar. Seal the jar and place it in a dark and temperate location. It will take 1-2 months for the jars to be fully colonized.", "Once fully colonized, scrape off the top layer of mycelium on the very top of the jar. Move the jars to an appropriate fruiting location, and pins should appear within a few days. Wrap plastic around the jars to help the enoki pins grow straight up, and harvest when they are of satisfactory height and cap size."],
        "link1":"https://www.gardeningknowhow.com/edible/vegetables/mushrooms/growing-enoki-mushrooms.htm",
        "link2":"https://www.youtube.com/watch?v=dY9q2l7xgJM",
        "link3":"https://www.seedsandspades.com/growing-enoki-mushrooms/",
        "link4":"",
        "storeLink":""
    },
    {
        "id":7,
        "name":"Oyster Mushroom Grow Kit",
        "imageName":"growkit",
        "description":"The Back to the Roots Organic Mushroom Grow Kit is the easiest way to grow your own organic and gourmet mushrooms at home! Just open, spray daily with the included mister, and in 10 days you'll be harvesting your own mushrooms right out of the box. The best part is you can grow a crop of mushrooms indoors all-year round right by your windowsill, and it'll keep growing fresh in any season. Each crop of mushrooms from our growing kit can produce 3 to 4 servings, and each box can grow up to two crops. Cook them however you like whether sauteed or grilled, or you can just add them into your favorite dishes like pasta.",
        "category":"grow kits",
        "instructions":["", "", "", "", ""],
        "link1":"",
        "link2":"",
        "link3":"",
        "link4":"",
        "storeLink":"https://www.amazon.com/Back-Roots-Mushroom-Mushrooms-Gardening/dp/B00CD0KZ78"
    },
    {
        "id":8,
        "name":"Field & Forest Products Grow Kits",
        "imageName":"growkit2",
        "description":"Field & Forest Products offers grow kits for the following mushrooms: Chestnut, Shiitake, Oyster, Lion's Mane, Comb Tooth, Reishi, and Black Pearl Oyster.",
        "category":"grow kits",
        "instructions":["", "", "", "", ""],
        "link1":"",
        "link2":"",
        "link3":"",
        "link4":"",
        "storeLink":"https://www.fieldforest.net/category/ready-to-fruit-kits"
    },
    {
        "id":9,
        "name":"North Spore Grow Kits",
        "imageName":"growkit3",
        "description":"North Spore offers grow kits for the following mushrooms: Lion's Mane, Blue Oyster, Pink Oyster, and Golden Oyster.",
        "category":"grow kits",
        "instructions":["", "", "", "", ""],
        "link1":"",
        "link2":"",
        "link3":"",
        "link4":"",
        "storeLink":"https://northspore.com/pages/growkits"
    }
]
