[
   {
       "id": 1001,
       "name": "Oyster Mushroom",
       "scientificName": "Pleurotus ostreatus",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Pleurotus ostreatus",
       "description": "Pleurotus ostreatus, the oyster mushroom or oyster fungus, is a common edible mushroom. It was first cultivated in Germany as a subsistence measure during World War I and is now grown commercially around the world for food. It is related to the similarly cultivated king oyster mushroom. Oyster mushrooms can also be used industrially for mycoremediation purposes. The oyster mushroom is one of the more commonly sought wild mushrooms, though it can also be cultivated on straw and other media. It has the bittersweet aroma of benzaldehyde (which is also characteristic of bitter almonds).",
       "appearance": "The mushroom has a broad, fan or oyster-shaped cap spanning 2–30 cm (3⁄4–11 3⁄4 in); natural specimens range from white to gray or tan to dark-brown; the margin is inrolled when young, and is smooth and often somewhat lobed or wavy. The flesh is white, firm, and varies in thickness due to stipe arrangement. The gills of the mushroom are white to cream, and descend on the stalk if present. If so, the stipe is off-center with a lateral attachment to wood. The spore print of the mushroom is white to lilac-gray, and best viewed on dark background. The mushroom's stipe is often absent. When present, it is short and thick.",
       "imageName": "oyster1",
       "funFact": "The oyster mushroom is one of the few known carnivorous mushrooms. Its mycelia can kill and digest nematodes, which is believed to be a way in which the mushroom obtains nitrogen.",
       "lookalikes": "none",
       "growable" : true,
       "locations" : ["Trees", "Dead Wood", "Cultivated"],
       "image1": "https://commons.wikimedia.org/wiki/File:Oyster_Mushroom_-_Pleurotus_ostreatus_(26433675278).jpg",
       "image2": "https://en.wikipedia.org/wiki/File:Pleurotus_ostreatus_JPG7.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Pleurotus_ostreatus",
       "category":"choice",
       "map":"oyster-map",
       "chart":"oyster-chart",
       "gbif":"https://www.gbif.org/species/2526530"

   },
   {
       "id": 1002,
       "name": "Shiitake Mushroom",
       "scientificName": "Lentinula edodes",
       "edible": "Edible",
       "gourmet": "Choice ",
       "family": "Marasmiaceae",
       "description": "The shiitake is an edible mushroom native to East Asia, which is cultivated and consumed in many East Asian countries. It is considered a medicinal mushroom in some forms of traditional medicine. Shiitake grow in groups on the decaying wood of deciduous trees, particularly shii and other chinquapins, chestnut, oak, maple, beech, sweetgum, poplar, hornbeam, ironwood, and mulberry. Its natural distribution includes warm and moist climates in Southeast Asia.",
       "appearance": "Shiitake mushrooms are small to medium in size with caps averaging 10-20 centimeters in diameter and are attached to thin stems. The caps range in color from light to dark brown and have a wide, umbrella shape with a characteristic curled rim. Inside, the cream-colored flesh is firm, chewy, and spongy.",
       "imageName": "shiitake1",
       "funFact": "In 2015, a study with 52 adults indicated that regular consumption of shiitake can result in improved immunity.",
       "lookalikes": "none",
       "growable" : true,
       "locations" : ["Dead Wood", "Cultivated", ""],
       "image1": "https://en.wikipedia.org/wiki/File:Shiitakegrowing.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Shiitake_mushrooms_2.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Shiitake",
       "category":"choice",
       "map":"shiitake-map",
       "chart":"shiitake-chart",
       "gbif":"https://www.gbif.org/species/2537743"

   },
   {
       "id": 1003,
       "name": "Shrimp of the woods",
       "scientificName": "Entoloma abortivum",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Entolomataceae",
       "description": "Entoloma abortivum, commonly known as the aborted entoloma or shrimp of the woods, is an edible mushroom in the Entolomataceae family of fungi. Caution should be used in identifying the species before eating. First named Clitopilus abortivus by Miles Joseph Berkeley and Moses Ashley Curtis, it was given its current name by the Dutch mycologist Marinus Anton Donk in 1949.",
       "appearance": "Need data",
       "imageName": "shrimp1",
       "funFact": "It was believed that the honey mushroom, Armillaria mellea, was parasitizing the entoloma. But research has indicated that the inverse may be true—the entoloma may be parasitizing the honey mushroom. There is still some disagreement by mushroom collectors about this since it is common to see both the aborted and unaborted forms of the entoloma on wood and in leaf litter, whereas Armillaria generally only fruits on wood. Both versions of the entoloma have also been observed when there are no Armillaria fruiting.",
       "lookalikes": "none",
       "growable" : false,
       "locations" : ["Dead Wood", "Forest Floor", ""],
       "image1": "https://commons.wikimedia.org/wiki/File:2013-02-14_Entoloma_abortivum_(Berk._and_M.A._Curtis)_Donk_309718.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:2013-10-13_Entoloma_abortivum_(Berk._and_M.A._Curtis)_Donk_389693.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Entoloma_abortivum",
       "category":"choice",
       "map":"shrimp-of-the-woods-map",
       "chart":"shrimp-of-the-woods-chart",
       "gbif":"https://www.gbif.org/species/2539731"

   },
   {
       "id": 1004,
       "name": "Artist's Conk",
       "scientificName": "Ganoderma Applanatum",
       "edible": "Not Edible",
       "gourmet": "Not Choice",
       "family": "Ganodermataceae",
       "description": "Ganoderma applanatum is a wood-decay fungus, causing a rot of heartwood in a variety of trees. It can also grow as a pathogen of live sapwood, particularly on older trees that are sufficiently wet. It is a common cause of decay and death of beech and poplar, and less often of several other tree genera, including alder, apple, elm, buckeye and horse chestnut, maple, oak, walnut, willow, western hemlock, Douglas fir, old or sick olive tree and spruce. A peculiarity of this fungus lies in its use as a drawing medium for artists. When the fresh white pore surface is rubbed or scratched with a sharp implement, dark brown tissue under the pores is revealed, resulting in visible lines and shading that become permanent once the fungus is dried.",
       "appearance": "This fungus grows as a mycelium within the wood of living and dead trees. It forms fruiting bodies that are 3–30 cm wide × 5–50 cm long × 1–10 cm thick, hard as leather, woody-textured, and inedible. They are white at first but soon turn dark red-brown. Brown spores are released from the pores on the underside of the fruiting body. The tubes are 4-12 mm deep and terminate in pores that are round with 4-6 per millimetre. The fruiting bodies are perennial, and may persist for multiple years, increasing in size and forming new layers of pores as they grow.",
       "imageName": "artists-conk1",
       "funFact": "G. applanatum is a medicinal farming crop that is used as a flavor enhancer in Asian cuisine. G. applanatum is non-digestible in its raw form, but it is used for cooking, because of its rich mushroom flavor. Blending with filtration, or cold pressing in water, is a common method for creating ganoderma drinks. Hot herbal soups, or fermentation in lemon acid with onion is a common use for cooking with G. applanatum slices as an umami flavor enhancer in fermented foods.",
       "lookalikes": "The similar Ganoderma brownii has thicker, darker flesh, often a yellow pore surface, and larger basidiospores than G. applanatum",
       "growable" : false,
       "locations" : ["Forest Floor", "Dead Wood", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Ganoderma_applanatum",
       "category":"inedible",
       "map":"artists-conk-map",
       "chart":"artists-conk-chart",
       "gbif":"https://www.gbif.org/species/2539731"

   },
   {
       "id": 1005,
       "name": "Beech Mushroom",
       "scientificName": "Hypsizygus tessellatus",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Tricholomataceae",
       "description": "Buna shimeji (Hypsizygus tessellatus) is an edible mushroom native to East Asia. It is cultivated locally in temperate climates in Europe, North America and Australia and sold fresh in super markets. Two variations are known: Buna-shimeji (Brown Beech Mushroom), Bunapi-shimeji (White Beech Mushroom).",
       "appearance": "In nature, shimeji are gilled mushrooms that grow on wood. Most often the mushroom is found on beech trees, hence the common name, beech mushroom. They are often small and thin in appearance and popular in many nations across the world.",
       "imageName": "beech1",
       "funFact": "Being tough when raw, the Shimeji should be cooked, having a bitter taste when raw which disappears completely upon cooking. The cooked mushroom has a firm, slightly crunchy texture and a nutty flavor. Preparation makes the mushroom easier to digest. It is often eaten with stir-fried foods including wild game and seafood. It is used in soups, stews and sauces.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Trees", "", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Hypsizygus_tessellatus",
       "category":"edible",
       "map":"beech-map",
       "chart":"beech-chart",
       "gbif":"https://www.gbif.org/species/9015458"

   },
   {
       "id": 1006,
       "name": "Beefsteak Mushroom",
       "scientificName": "Fistulina hepatica",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Fistulinaceae",
       "description": "Fistulina hepatica (beefsteak fungus, also known as beefsteak polypore, ox tongue, or tongue mushroom) is an unusual bracket fungus classified in the Agaricales, that is commonly seen in Britain, but can be found in North America, Australia, North Africa, Southern Africa and the rest of Europe. As its name suggests, it looks remarkably similar to a slab of raw meat. It has been used as a meat substitute in the past, and can still be found in some French markets. It has a sour, slightly acidic taste. For eating it must be collected young and it may be tough and need long cooking.",
       "appearance": "The shape resembles a large tongue, and it is rough-surfaced with a reddish-brown colour. The spores are released from minute pores on the creamy-white underside of the fruit body. A younger Fistulina hepatica is a pinkish-red colour, and it darkens with age. It bleeds a dull red juice when cut, with the cut flesh further resembling meat. It is edible and considered choice.",
       "imageName": "beefsteak1",
       "funFact": "The species is fairly common, and can often be found on oaks and sweet chestnut, from August to the end of autumn, on either living or dead wood. It has a tendency to impart a reddish-brown stain to the living wood of oaks, creating a desirable timber type. In Australia, it can be found growing from wounds on Eucalyptus trees. It causes a brown rot on the trees which it infects.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Trees", "Dead Wood", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Fistulina_hepatica",
       "category":"choice",
       "map":"beefsteak-mushroom-map",
       "chart":"beefsteak-chart",
       "gbif":"https://www.gbif.org/species/2531012"

   },
   {
       "id": 1007,
       "name": "Button Mushroom",
       "scientificName": "Agaricus bisporus",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Agaricaceae",
       "description": "Agaricus bisporus is an edible basidiomycete mushroom native to grasslands in Europe and North America. It has two color states while immature – white and brown – both of which have various names, with additional names for the mature state. A. bisporus is cultivated in more than seventy countries, and is one of the most commonly and widely consumed mushrooms in the world. This mushroom is commonly found worldwide in fields and grassy areas following rain, from late spring through to autumn, especially in association with manure. In many parts of the world it is widely collected and eaten; however, resemblance to deadly or poisonous lookalikes should be noted.",
       "appearance": "The pileus or cap of the original wild species is a pale grey-brown in color, with broad, flat scales on a paler background and fading toward the margins. It is first hemispherical in shape before flattening out with maturity, and 5–10 centimetres (2–4 inches) in diameter. The narrow, crowded gills are free and initially, pink, then red-brown and finally a dark brown with a whitish edge from the cheilocystidia.",
       "imageName": "button1",
       "funFact": "A. bisporus is now cultivated in at least seventy countries throughout the world. Global production in the early 1990s was reported to be more than 1.4 billion kilograms (1.5 million short tons), worth more than US$2 billion. In the U.S., the white button form of A. bisporus alone accounts for about 90% of mushrooms sold.",
       "lookalikes": "The common mushroom could be confused with young specimens of the deadly poisonous destroying angel (Amanita sp.), but the latter may be distinguished by their volva or cup at the base of the mushroom and pure white gills (as opposed to pinkish or brown of A. bisporus). Thus it is always important to clear away debris and examine the base of such similar mushrooms, as well as cutting open young specimens to check the gills. Furthermore, the destroying angel grows in mossy woods and lives symbiotically with spruce.A more common and less dangerous mistake is to confuse A. bisporus with Agaricus xanthodermus, an inedible mushroom found worldwide in grassy areas. A. xanthodermus has an odor reminiscent of phenol; its flesh turns yellow when bruised. This fungus causes nausea and vomiting in some people. The poisonous European species Entoloma sinuatum has a passing resemblance as well, but has yellowish gills, turning pink, and it lacks a ring.",
       "growable" : true,
       "locations" : ["Forest Floor", "Cultivated", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Agaricus_bisporus",
       "category":"choice",
       "map":"button-map",
       "chart":"button-chart",
       "gbif":"https://www.gbif.org/species/5243447"

   },
   {
       "id": 1008,
       "name": "Cauliflower Mushroom",
       "scientificName": "Sparassis",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Sparassidaceae",
       "description": "Sparassis (also known as cauliflower mushroom) is a genus of parasitic and saprobic mushrooms characterised by their unique shape and appearance. This appearance can be described as similar to a sea sponge, a brain, or a head of cauliflower, from which it has been given its popular name. They are increasingly cultivated and being sold in Korea, Japan, United States and Australia. The generic name comes from the Greek sparassein meaning to tear.",
       "appearance": "Their color can range from light brown-yellow to yellow-grey or a creamy white cauliflower colour. They are normally 10 to 25 cm tall, but can grow to be quite large, with reported cases of fruiting bodies more than half a meter tall and 14 kg in weight. Because of their unique look and size, they are unlikely to be mistaken for any poisonous/inedible mushrooms. They grow as parasites or saprobes on the roots or bases of various species of hardwoods, especially oak, and conifers, and hence are most commonly found growing close to fir, pine, oak or spruce trees.",
       "imageName": "cauliflower1",
       "funFact": "Experiments suggest that S. crispa contains chemicals which may stimulate the immune system and have anti-tumor properties.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "Dead Wood", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Sparassis",
       "category":"edible",
       "map":"cauliflower-mushroom-map",
       "chart":"cauliflower-chart",
       "gbif":"https://www.gbif.org/species/2550232"

   },
   {
       "id": 1009,
       "name": "Chanterelle Mushroom",
       "scientificName": "Cantharellus",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Cantharellaceae",
       "description": "Though records of chanterelles being eaten date back to the 16th century, they first gained widespread recognition as a culinary delicacy with the spreading influence of French cuisine in the 18th century, when they began appearing in palace kitchens. For many years, they remained notable for being served at the tables of nobility. Chanterelles as a group are generally described as being rich in flavor, with a distinctive taste and aroma difficult to characterize. Some species have a fruity odor, others a more woody, earthy fragrance, and still others can even be considered spicy. The golden chanterelle is perhaps the most sought-after and flavorful chanterelle, and many chefs consider it on the same short list of gourmet fungi as truffles and morels. It therefore tends to command a high price in both restaurants and specialty stores.",
       "appearance": "They are orange, yellow or white, meaty and funnel-shaped. On the lower surface, underneath the smooth cap, most species have rounded, forked folds that run almost all the way down the stipe, which tapers down seamlessly from the cap. Many species emit a fruity aroma, reminiscent of apricots, and often have a mildly peppery taste (hence its German name, Pfefferling).",
       "imageName": "chanterelle1",
       "funFact": "They tend to grow in clusters in mossy coniferous forests, but are also often found in mountainous birch forests and among grasses and low-growing herbs.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Chanterelle",
       "category":"choice",
       "map":"chanterelle-map",
       "chart":"chanterelle-chart",
       "gbif":"https://www.gbif.org/species/9623860"

   },
   {
       "id": 1010,
       "name": "Chicken of the Woods Mushroom",
       "scientificName": "Laetiporus sulphureus",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Polyporaceae",
       "description": "Laetiporus sulphureus is a species of bracket fungus (fungi that grow on trees) found in Europe and North America. Its common names are crab-of-the-woods, sulphur polypore, sulphur shelf, and chicken-of-the-woods. Its fruit bodies grow as striking golden-yellow shelf-like structures on tree trunks and branches. Old fruitbodies fade to pale beige or pale grey. The undersurface of the fruit body is made up of tubelike pores rather than gills. Laetiporus sulphureus is a saprophyte and occasionally a weak parasite, causing brown cubical rot in the heartwood of trees on which it grows. Unlike many bracket fungi, it is edible when young, although adverse reactions have been reported.",
       "appearance": "The fruiting body emerges directly from the trunk of a tree and is initially knob-shaped, but soon expands to fan-shaped shelves, typically growing in overlapping tiers. It is sulphur-yellow to bright orange in color and has a suedelike texture. Old fruitbodies fade to tan or whitish. Each shelf may be anywhere from 5 to 60 centimetres (2 to 23 1⁄2 inches) across and up to 4 cm (1 1⁄2 in) thick. The fertile surface is sulphur-yellow with small pores or tubes and produces a white spore print. When fresh, the flesh is succulent with a strong fungal aroma and exudes a yellowish, transparent juice, but soon becomes dry and brittle.",
       "imageName": "chicken-of-the-woods1",
       "funFact": "Many people think that the mushroom tastes like crab or lobster leading to the nickname lobster-of-the-woods. It is highly regarded in Germany and North America.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Trees", "Dead Wood", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Laetiporus_sulphureus",
       "category":"choice",
       "map":"chicken-of-the-woods-map",
       "chart":"chicken-of-the-woods-chart",
       "gbif":"https://www.gbif.org/species/9072021"

   },
   {
       "id": 1011,
       "name": "Corn Smut",
       "scientificName": "Ustilago maydis",
       "edible": "Use Caution",
       "gourmet": "Not Choice",
       "family": "Ustilaginaceae",
       "description": "Corn smut is a plant disease caused by the pathogenic fungus Ustilago maydis that causes smut on maize and teosinte. The fungus forms galls on all above-ground parts of corn species. It is edible, and is known in Mexico as the delicacy huitlacoche; which is eaten, usually as a filling, in quesadillas and other tortilla-based foods, and in soups.",
       "appearance": "The fungus infects all parts of the host plant by invading the ovaries of its host. The infection causes the corn kernels to swell up into tumor-like galls, whose tissues, texture, and developmental pattern are mushroom-like. These galls are made up of hypertrophied cells of the infected plant, along with resulting fungal threads, and blue-black spores. These dark-colored spores give the cob a burned, scorched appearance; this is the origin of the generic name Ustilago, from the Latin word ustilare (to burn).",
       "imageName": "corn-smut2",
       "funFact": "Corn smut, while a delicacy across the world, can also have economical repercussions. Aydogdu and Boyraz found that corn exposed to corn smut resulted in a 33% yield loss. With corn being a staple crop for both animals and people, a 33% yield loss could prove disastrous to food supply. However, out of the many types of corn, sweet corn is the most affected by corn smut.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Corn", "", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Corn_smut",
       "category":"use caution",
       "map":"corn-smut-map",
       "chart":"corn-smut-chart",
       "gbif":"https://www.gbif.org/species/2557469"

   },
   {
       "id": 1012,
       "name": "Cordyceps",
       "scientificName": "Cordyceps militaris",
       "edible": "Use Caution",
       "gourmet": "Not Choice",
       "family": "Cordycipitaceae",
       "description": "Cordyceps militaris is a species of fungus in the family Cordycipitaceae, and the type species of the genus Cordyceps. It was originally described by Carl Linnaeus in 1753 as Clavaria militaris. It is a potential harbour of bio-metabolites for herbal drugs and evidences are available about its applications for revitalization of various systems of the body from ancient times. C. militaris can be cultivated in a variety of media including silkworm pupae, rice, or liquid nutrition. It is considered inedible in American sources, but in Asia the fruiting body is cooked as a mushroom in dishes like chicken soup.",
       "appearance": "The fungus forms 20–50 mm high, club-shaped and orange/red fruiting bodies, which grow out of dead underground pupae. The club is covered with the stroma, into which the actual fruit bodies, the perithecia, are inserted. The surface appears roughly punctured. The inner fungal tissue is whitish to pale orange.",
       "imageName": "cordyceps1",
       "funFact": "Cordyceps militaris is a entomopathogenic fungus, meaning it parasitizes insects. Many authors consider it quite common, spread throughout the northern hemisphere, and fruiting bodies appear in Europe from August to November.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Dead Wood", "Forest Floor", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Cordyceps_militaris",
       "category":"use caution",
       "map":"cordyceps-map",
       "chart":"cordyceps-chart",
       "gbif":"https://www.gbif.org/species/7567077"

   },
   {
       "id": 1013,
       "name": "Enoki",
       "scientificName": "Flammulina velutipes",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Physalacriaceae",
       "description": "Enoki (Flammulina velutipes), also known as velvet shank, is a species of edible mushroom in the family Physalacriaceae. It is well-known for its role in Japanese cuisine, where it is also known as enokitake. There is a significant difference in appearance between the wild and cultivated types of the mushroom. Cultivated mushrooms have not been exposed to light, resulting in a white color, whereas wild mushrooms usually display a dark brown color. Cultivated mushrooms are grown in a carbon dioxide (CO2)-rich environment to nurture the development of long thin stems, whereas wild mushrooms produce a much shorter and thicker stem.",
       "appearance": "The mushroom naturally grows on the stumps of the Chinese hackberry tree (Celtis sinensis) and on other trees, such as ash, mulberry and persimmon trees. Enoki can be sourced September- March and has been named winter fungus due to its seasonality. Wild forms differ in color, texture, and sliminess and may be called futu, seafood mushrooms, winter mushrooms or winter fungus, velvet foot, velvet stem or velvet shank.",
       "imageName": "enoki1",
       "funFact": "Commercially farmed enoki is a long, thin white mushroom and is a popular ingredient for soups, especially in East Asian cuisine, but can be used for salads and other dishes. The mushroom has a crisp texture and can be refrigerated for approximately one week. This shape is due to a CO2-rich atmosphere used in farming. The farmed form is also known as golden needle mushroom, futu mushroom or lily mushroom. The farmed F. velutipes is sold both fresh and canned.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Trees", "Dead Wood", "Cultivated"],
       "image1": "https://en.wikipedia.org/wiki/File:Flammulina_velutipes.JPG",
       "image2": "https://en.wikipedia.org/wiki/File:EnokitakeJapaneseMushroom.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Cordyceps_militaris",
       "category":"choice",
       "map":"enoki-map",
       "chart":"enoki-chart",
       "gbif":"https://www.gbif.org/species/3341441"

   },
   {
       "id": 1014,
       "name": "Fly Agaric",
       "scientificName": "Amanita muscaria",
       "edible": "Poisonous",
       "gourmet": "Not Choice",
       "family": "Amanitaceae",
       "description": "Amanita muscaria, commonly known as the fly agaric or fly amanita, is a basidiomycete of the genus Amanita. It is also a muscimol mushroom. Native throughout the temperate and boreal regions of the Northern Hemisphere, Amanita muscaria has been unintentionally introduced to many countries in the Southern Hemisphere, generally as a symbiont with pine and birch plantations, and is now a true cosmopolitan species. It associates with various deciduous and coniferous trees.",
       "appearance": "Arguably the most iconic toadstool species, the fly agaric is a large white-gilled, white-spotted, usually red mushroom, and is one of the most recognizable and widely encountered in popular culture. Despite its easily distinguishable features, Amanita muscaria is a fungus with several known variations, or subspecies. These subspecies are slightly different, some have yellow or white caps, but they are all usually called fly agarics, and they are most of the time recognizable by their notable white spots.",
       "imageName": "fly-agaric1",
       "funFact": "Although classified as poisonous, reports of human deaths resulting from A. muscaria ingestion are extremely rare. After parboiling twice with water draining—which weakens its toxicity and breaks down the mushroom's psychoactive substances—it is eaten in parts of Europe, Asia, and North America. All Amanita muscaria varieties, but in particular A. muscaria var. muscaria, are noted for their hallucinogenic properties, with the main psychoactive constituents being the neurotoxins ibotenic acid and muscimol.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/Amanita_muscaria#/media/File:2006-10-25_Amanita_muscaria_crop.jpg",
       "image2": "https://en.wikipedia.org/wiki/Amanita_muscaria#/media/File:Amanita_muscaria_var._formosa_sensu_Thiers.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Amanita_muscaria",
       "category":"poisonous",
       "map":"fly-agaric-map",
       "chart":"fly-agaric-chart",
       "gbif":"https://www.gbif.org/species/8168319"

   },
   {
       "id": 1015,
       "name": "Giraffe Spots",
       "scientificName": "Peniophora albobadia",
       "edible": "Not Edible",
       "gourmet": "Not Choice",
       "family": "Peniophoraceae",
       "description": "Peniophora albobadia is a species of crust fungus in the family Peniophoraceae. It is a plant pathogen that affects stone fruits. First described scientifically by Lewis David de Schweinitz in 1822, it was transferred to the genus Peniophora by Jacques Boidin in 1961. It is most commonly found in the United States",
       "appearance": "Need data!",
       "imageName": "giraffe-spots1",
       "funFact": "Need data!",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Dead Wood", "", ""],
       "image1": "https://en.wikipedia.org/wiki/File:Peniophora_albobadia_196080.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Peniophora_albobadia_6.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Peniophora_albobadia",
       "category":"inedible",
       "map":"giraffe-spots-map",
       "chart":"giraffe-spots-chart",
       "gbif":"https://www.gbif.org/species/2552247"

   },
   {
       "id": 1016,
       "name": "Giant Puffball",
       "scientificName": "Calvatia gigantea",
       "edible": "Use Caution",
       "gourmet": "Not Choice",
       "family": "Agaricaceae",
       "description": "Calvatia gigantea, commonly known as the giant puffball, is a puffball mushroom commonly found in meadows, fields, and deciduous forests usually in late summer and autumn. It is found in temperate areas throughout the world.",
       "appearance": "Most giant puffballs grow to be 10 to 50 centimetres (4 to 20 inches), sometimes to be 90 cm (35 in) in diameter; although occasionally some can reach diameters up to 150 cm (60 in) and weights of 20 kg (44 lb). The inside of mature Giant puffballs is greenish brown, whereas the interior of immature puffballs is white. The large white mushrooms are edible when young.",
       "imageName": "giant-puffball1",
       "funFact": "The fruiting body of a puffball mushroom will develop within the period of a few weeks and soon begin to decompose and rot, at which point it is dangerous to eat. Unlike most mushrooms, all the spores of the giant puffball are created inside the fruiting body; large specimens can easily contain several trillion spores.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/Calvatia_gigantea#/media/File:Giant_Puffball_Lemoine_Point.jpg",
       "image2": "https://en.wikipedia.org/wiki/Calvatia_gigantea#/media/File:Calvatia_gigantea.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Calvatia_gigantea",
       "category":"use caution",
       "map":"giant-puffball-map",
       "chart":"giant-puffball-chart",
       "gbif":"https://www.gbif.org/species/2536058"

   },
   {
       "id": 1017,
       "name": "Green-spored Lepiota",
       "scientificName": "Chlorophyllum molybdites",
       "edible": "Poisonous",
       "gourmet": "Not Choice",
       "family": "Agaricaceae",
       "description": "Chlorophyllum molybdites, which has the common names of false parasol, green-spored Lepiota and vomiter, is a widespread mushroom. Poisonous and producing severe gastrointestinal symptoms of vomiting and diarrhea, it is commonly confused with the shaggy parasol or shaggy mane, and is the most commonly consumed poisonous mushroom in North America. Its large size and similarity to the edible parasol mushroom, as well as its habit of growing in areas near human habitation, are reasons cited for this. The nature of the poisoning is predominantly gastrointestinal.",
       "appearance": "It is an imposing mushroom with a pileus (cap) up to 40 cm in diameter, hemispherical and with a flattened top. The cap is whitish in colour with coarse brownish scales. The gills are free and white, usually turning dark and green with maturity. It has a rare green spore print. The tall stipe may be up to 25 cm tall and bears a ring. This mushroom lacks the snakeskin pattern that is generally present on the parasol mushroom. Chlorophyllum molybdites grows in lawns and parks across eastern North America and California, as well as temperate and subtropical regions around the world. Fruiting bodies generally appear after summer and autumn rains.",
       "imageName": "lepiota1",
       "funFact": "Chlorophyllum molybdites is the most frequently eaten poisonous mushroom in North America. The symptoms are predominantly gastrointestinal in nature, with vomiting, diarrhea and colic, often severe, occurring 1–3 hours after consumption. Although these poisonings can be severe, none has yet resulted in death.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/Chlorophyllum_molybdites#/media/File:Chlorophyllum_molybdites_Guadalajara.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Chlorophyllum_molybdites.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Chlorophyllum_molybdites",
       "category":"poisonous",
       "map":"green-spored-lepiota-map",
       "chart":"green-spored-lepiota-chart",
       "gbif":"https://www.gbif.org/species/5243168"

   },
   {
       "id": 1018,
       "name": "Shingled Hedgehog",
       "scientificName": "Sarcodon imbricatus",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Bankeraceae",
       "description": "Sarcodon imbricatus, commonly known as the shingled hedgehog or scaly hedgehog, is a species of tooth fungus in the order Thelephorales. The mushroom is edible. Many sources report it has a bitter taste, but others have found it delicious and suspect that the bitter specimens may be similar related species. The mushroom has a large, brownish cap with large brown scales and may reach 30 cm (12 in) in diameter. On the underside it sports greyish, brittle teeth instead of gills, and has white flesh. Its spore print is brown. It is associated with spruce (Picea), appearing in autumn. It ranges throughout North America and Europe, although collections from the British Isles are now assigned to the similar species Sarcodon squamosus.",
       "appearance": "The mushrooms, or fruiting bodies, can be quite large in size. the brownish or greyish cap measures up to 30 cm (12 in) in diameter and is covered with coarse darker brown scales. It is funnel-shaped. The underside bears soft, pale grey 'teeth' rather than gills. These are 0.5–1 cm long and brittle. The pale grey or brown stipe may reach 8 centimetres (3.1 in) high and 3 centimetres (1.2 in) wide, and may be narrower at the base and is sometimes eccentric.",
       "imageName": "shingled-hedgehog1",
       "funFact": "The fungus can be bitter, although this is less apparent in younger specimens. Submerging the mushrooms in boiling water will remove this. It can be pickled or dried and used as flavouring. In Bulgaria it is collected, dried and finely ground to be used as an aromatic mushroom flour. It is reported as edible but of poor quality in the United States by some sources but as deliciously edible by others.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Sarcodon_imbricatus#/media/File:Habichtspilz-Sarcodon-imbricatus.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Sarcodon_imbricatus_T64.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Sarcodon_imbricatus",
       "category":"edible",
       "map":"shingled-hedgehog-map",
       "chart":"shingled-hedgehog-chart",
       "gbif":"https://www.gbif.org/species/5238865"

   },
   {
       "id": 1019,
       "name": "Sweet Tooth",
       "scientificName": "Hydnum repandum",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Hydnaceae",
       "description": "Hydnum repandum, commonly known as the sweet tooth, wood hedgehog or hedgehog mushroom, is a basidiomycete fungus of the family Hydnaceae. First described by Carl Linnaeus in 1753, it is the type species of the genus Hydnum. A mycorrhizal fungus, Hydnum repandum is broadly distributed in Europe where it fruits singly or in close groups in coniferous or deciduous woodland. This is a choice edible species, although mature specimens can develop a bitter taste. It has no poisonous lookalikes. Mushrooms are collected and sold in local markets of Europe and Canada.",
       "appearance": "The fungus produces fruit bodies (mushrooms) that are characterized by their spore-bearing structures—in the form of spines rather than gills—which hang down from the underside of the cap. The cap is dry, colored yellow to light orange to brown, and often develops an irregular shape, especially when it has grown closely crowded with adjacent fruit bodies. The mushroom tissue is white with a pleasant odor and a spicy or bitter taste. All parts of the mushroom stain orange with age or when bruised.",
       "imageName": "sweet-tooth1",
       "funFact": "Hydnum repandum is frequently sold with chanterelles in Italy, and in France, it is one of the officially recognized edible species sold in markets. In Europe, it is usually sold under its French name pied-de-mouton (sheep's foot). It is also collected and sold in local markets of Mexico, Spain and British Columbia, Canada. H. repandum mushrooms are also used as a food source by the red squirrel.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "Dead Wood", ""],
       "image1": "https://en.wikipedia.org/wiki/Hydnum_repandum#/media/File:Hedgehog_fungi2.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Semmel-Stoppelpilz_Semmelgelber_Stacheling_Hydnum_repandum.JPG",
       "wiki": "https://en.wikipedia.org/wiki/Hydnum_repandum#Ecology,_habitat_and_distribution",
       "category":"choice",
       "map":"sweet-tooth-map",
       "chart":"sweet-tooth-chart",
       "gbif":"https://www.gbif.org/species/2554716"

   },
   {
       "id": 1020,
       "name": "Horn of Plenty",
       "scientificName": "Craterellus cornucopioides",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Cantharellaceae",
       "description": "Craterellus cornucopioides, or horn of plenty, is an edible mushroom. It is also known as the black chanterelle, black trumpet, trompette de la mort (French), trombetta dei morti (Italian) or trumpet of the dead. This fungus is found in woods in Europe, North America, Japan and Korea. Mainly it grows under beech, oak or other broad-leaved trees, especially in moss in moist spots on heavy calcareous soil. In Europe it is generally common but seems to be rare in some countries such as the Netherlands. It appears from June to November, and in the UK, from August to November. The mushroom is usually almost black, and it is hard to find because its dark colour easily blends in with the leaf litter on the forest floor. Hunters of this mushroom say it is like looking for black holes in the ground.",
       "appearance": "The fruiting body does not have a separation into stalk and cap, but is shaped like a funnel expanded at the top, normally up to about 10 centimetres (4 inches) tall and 7 cm (3 in) in diameter (but said to grow exceptionally to 15 cm or 6 in). The upper and inner surface is black or dark grey, and the lower and outer fertile surface is a much lighter shade of grey. The fertile surface is more or less smooth but may be somewhat wrinkled.",
       "imageName": "horn-of-plenty1",
       "funFact": "A possible origin for the name 'trumpet of the dead' is that the growing mushrooms were seen as being played as trumpets by dead people under the ground.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Craterellus_cornucopioides#/media/File:2010-08-24_Craterellus_cinereus_(Pers.)_Qu%C3%A9l_100703_cropped.jpg",
       "image2": "https://en.wikipedia.org/wiki/Craterellus_cornucopioides#/media/File:Craterellus_cornucopioides_JPG1.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Craterellus_cornucopioides",
       "category":"choice",
       "map":"horn-of-plenty-map",
       "chart":"horn-of-plenty-chart",
       "gbif":"https://www.gbif.org/species/2554662"

   },
   {
       "id": 1021,
       "name": "Jack-o'-lantern Mushroom",
       "scientificName": "Omphalotus olearius",
       "edible": "Poisonous",
       "gourmet": "Not Choice",
       "family": "Marasmiaceae",
       "description": "Omphalotus olearius, commonly known as the jack-o'-lantern mushroom, is a poisonous orange gilled mushroom that to an untrained eye appears similar to some chanterelles. It is notable for its bioluminescent properties. It is found in woodland areas in Europe, where it grows on decaying stumps, on buried roots or at the base of hardwood trees. It has also been reported from the Western Cape Province, South Africa. A similar, but phylogenetically distinct species found in eastern North America is Omphalotus illudens.",
       "appearance": "The jack-o'-lantern mushroom is orange. Its bioluminescence, a blue-green color, can be observed in fresh specimens in low light conditions once the eye becomes dark-adapted. The whole mushroom does not glow—only the gills do so. This is due to an enzyme called luciferase, acting upon a compound called luciferin, leading to the emission of light much as fireflies do when glowing.",
       "imageName": "jack-o-lantern1",
       "funFact": "While not lethal, consuming this mushroom leads to very severe cramps, vomiting, and diarrhea.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "Dead Wood", "Trees"],
       "image1": "https://en.wikipedia.org/wiki/Omphalotus_olearius#/media/File:Omphalotus_olearius100.jpg",
       "image2": "https://en.wikipedia.org/wiki/Omphalotus_olearius#/media/File:Omphalotus_olearius.JPG",
       "wiki": "https://en.wikipedia.org/wiki/Omphalotus_olearius",
       "category":"poisonous",
       "map":"jack-o-lantern-map",
       "chart":"jack-o-latern-chart",
       "gbif":"https://www.gbif.org/species/2538088"

   },
   {
       "id": 1022,
       "name": "King Oyster Mushroom",
       "scientificName": "Pleurotus eryngii",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Pleurotaceae",
       "description": "Pleurotus eryngii (also known as king trumpet mushroom, French horn mushroom, king oyster mushroom, king brown mushroom, boletus of the steppes, trumpet royale, aliʻi oyster) is an edible mushroom native to Mediterranean regions of Europe, the Middle East, and North Africa, but also grown in many parts of Asia. The mushroom has a good shelf life and is cultivated widely. It has little flavor or aroma when raw. When cooked, it develops rich umami flavor and a meaty texture.",
       "appearance": "P. eryngii is the largest species in the oyster mushroom genus, Pleurotus, which also contains the oyster mushroom Pleurotus ostreatus. It has a thick, meaty white stem and a small tan cap (in young specimens). Its natural range extends from the Atlantic Ocean through the Mediterranean Basin and Central Europe into Western Asia and India. Unlike other species of Pleurotus, which are primarily wood-decay fungi, the P. eryngii complex are also weak parasites on the roots of herbaceous plants, although they may also be cultured on organic wastes.",
       "imageName": "king-oyster1",
       "funFact": "Pleurotus eryngii may contain chemicals that stimulate the immune system. Dietary intake of Pleurotus eryngii may function as cholesterol-lowering dietary agent.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Forest Floor", "Fields", "Cultivated"],
       "image1": "https://commons.wikimedia.org/wiki/File:Kr%C3%A4uter-Seitling_Pleurotus_eryngii.jpg",
       "image2": "https://en.wikipedia.org/wiki/Pleurotus_eryngii#/media/File:Pleurotus_eryngii.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Pleurotus_eryngii",
       "category":"choice",
       "map":"king-oyster-map",
       "chart":"king-oyster-chart",
       "gbif":"https://www.gbif.org/species/9075265"

   },
   {
       "id": 1023,
       "name": "Lobster Mushroom",
       "scientificName": "Hypomyces lactifluorum",
       "edible": "Use Caution",
       "gourmet": "Not Choice",
       "family": "Hypocreaceae",
       "description": "The Lobster mushroom, Hypomyces lactifluorum, contrary to its common name, is not a mushroom, but rather a parasitic ascomycete fungus that grows on certain species of mushrooms, turning them a reddish orange color that resembles the outer shell of a cooked lobster. Lobster mushrooms are widely eaten and enjoyed fresh. They are commercially marketed and sometimes found in grocery stores; they have been made available at markets in Oregon. They have a seafood-like flavor and a firm, dense texture.",
       "appearance": "H. lactifluorum specifically attacks members of the genera Lactarius and Lactifluus (milk-caps), and Russula (brittlegills), such as Russula brevipes and Lactifluus piperatus in North America. At maturity, H. lactifluorum thoroughly covers its host, rendering it unidentifiable.",
       "imageName": "lobster1",
       "funFact": "While edible, field guides note the hypothetical possibility that H. lactifluorum could parasitize a toxic host and that individuals should avoid consuming lobster mushrooms with unknown hosts, although no instances of toxicity have been recorded.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Forest Floor", "Dead Wood", "Cultivated"],
       "image1": "https://en.wikipedia.org/wiki/Hypomyces_lactifluorum#/media/File:Lobster_mushrooms.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Lobster_Mushroom_2.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Hypomyces_lactifluorum",
       "category":"use caution",
       "map":"lobster-mushroom-map",
       "chart":"lobster-chart",
       "gbif":"https://www.gbif.org/species/2561802"

   },
   {
       "id": 1024,
       "name": "Hen of the Woods",
       "scientificName": "Grifola frondosa",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Meripilaceae",
       "description": "Grifola frondosa is a polypore mushroom that grows at the base of trees, particularly oaks. Also known as hen-of-the-woods, maitake (舞茸, 'dancing mushroom'), ram's head or sheep's head. It is typically found in late summer to early autumn. It is native to China, Europe, and North America. Like the sulphur shelf mushroom, G. frondosa is a perennial fungus that often grows in the same place for a number of years in succession. It occurs most prolifically in the northeastern regions of the United States, but has been found as far west as Idaho.",
       "appearance": "G. frondosa grows from an underground tuber-like structure known as a sclerotium, about the size of a potato. The fruiting body, occurring as large as 100 centimetres (40 inches), rarely 150 cm (60 in), is a cluster consisting of multiple grayish-brown caps which are often curled or spoon-shaped, with wavy margins and 2–10 cm (1–4 in) broad. The undersurface of each cap bears about one to three pores per millimeter, with the tubes rarely deeper than 3 mm (1⁄8 in). The milky-white stipe (stalk) has a branchy structure and becomes tough as the mushroom matures.",
       "imageName": "woods1",
       "funFact": "In Japan, the maitake can grow to more than 45 kilograms (100 pounds), earning this giant mushroom the title 'king of mushrooms'.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Forest Floor", "Dead Wood", "Cultivated"],
       "image1": "https://en.wikipedia.org/wiki/Hypomyces_lactifluorum#/media/File:Lobster_mushrooms.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Hen_of_the_Woods_(Grifola_frondosa)_(5169557976).jpg",
       "wiki": "https://en.wikipedia.org/wiki/Grifola_frondosa",
       "category":"choice",
       "map":"hen-of-the-woods-map",
       "chart":"hen-of-the-woods-chart",
       "gbif":"https://www.gbif.org/species/2540800"

   },
   {
       "id": 1025,
       "name": "Milk Caps",
       "scientificName": "Lactarius",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Russulaceae",
       "description": "Lactarius is a genus of mushroom-producing, ectomycorrhizal fungi, containing several edible species. The species of the genus, commonly known as milk-caps, are characterized by the milky fluid ('latex') they exude when cut or damaged. Like the closely related genus Russula, their flesh has a distinctive brittle consistency. It is a large genus with over 500 known species, mainly distributed in the Northern hemisphere. Recently, the genus Lactifluus has been separated from Lactarius based on molecular phylogenetic evidence.",
       "appearance": "Distinguishing Lactarius from Lactifluus based on morphology alone is difficult; there are no synapomorphic characters known so far that define both genera unequivocally but tendencies exist. Characters important for identification of milk-caps (Lactarius and Lactifluus) are: initial colour of the latex and color change, texture of cap surface, taste (mild, peppery, or bitter) of latex and flesh, odor, and microscopical features of the spores and the cap curticle (pileipellis). The habitat and especially the type of host tree can also be critical. While there are some easily recognizable species, other species can be quite hard to determine without microscopical examination.",
       "imageName": "milk-caps1",
       "funFact": "Several Lactarius species are edible. L. deliciosus notably ranks among the most highly valued mushrooms in the Northern hemisphere, while opinions vary on the taste of other species, such as L. indigo or L. deterrimus. Several species are reported to be regularly collected for food in Russia, Tanzania and Hunan, China. Some Lactarius are considered toxic, for example L. turpis, which contains a mutagenic compound, or L. helvus. There are, however, no deadly poisonous mushrooms in the genus.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "Dead Wood", ""],
       "image1": "https://en.wikipedia.org/wiki/Lactarius#/media/File:Lactarius_vietus041031w.jpg",
       "image2": "https://en.wikipedia.org/wiki/Lactarius#/media/File:Lactarius_pyrogallus.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Lactarius",
       "category":"use caution",
       "map":"milk-caps-map",
       "chart":"milk-caps-chart",
       "gbif":"https://www.gbif.org/species/2532156"

   },
   {
       "id": 1026,
       "name": "Pine Mushroom",
       "scientificName": "Tricholoma matsutake",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Tricholomataceae",
       "description": "Matsutake (Japanese: 松茸), Tricholoma matsutake, is a highly sought species of choice edible mycorrhizal mushroom that grows in Asia, Europe, and North America. It is prized in Japanese, Korean, and Chinese cuisines for its distinct spicy-aromatic odor. ",
       "appearance": "Matsutake mushrooms grow under trees and are usually concealed under litter on the forest floor, forming a symbiotic relationship with roots of various tree species. Matsutake mushrooms grow in eastern Asia in China, Japan, Korea, Bhutan and Laos; in Europe, in Estonia, Finland, Norway, Poland and Sweden; and on the Pacific coasts of Canada and the United States.",
       "imageName": "pine-mushroom1",
       "funFact": "Domestic production of matsutake in Japan has been sharply reduced over the last 50 years due to the pine-killing nematode Bursaphelenchus xylophilus, which has influenced the price a great deal. The price for matsutake in the Japanese market is highly dependent on quality, availability, and origin. The Japanese matsutake at the beginning of the season, which is the highest grade, can go up to $1,000 per kilogram.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Matsutake#/media/File:Matsutake.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Tricholoma_matsutake_(9627995451).jpg",
       "wiki": "https://en.wikipedia.org/wiki/Matsutake",
       "category":"choice",
       "map":"pine-mushroom-map",
       "chart":"pine-mushroom-chart",
       "gbif":"https://www.gbif.org/species/5241820"

   },
   {
       "id": 1027,
       "name": "Meadow Mushroom",
       "scientificName": "Agaricus campestris",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Agaricaceae",
       "description": "Agaricus campestris is a widely eaten gilled mushroom closely related to the cultivated button mushroom Agaricus bisporus. It is commonly known as the field mushroom or, in North America, meadow mushroom. Agaricus campestris is found in fields and grassy areas after rain from late summer onwards worldwide. It is often found on lawns in suburban areas. Appearing in small groups, in fairy rings, or solitary. Owing to the demise of horse-drawn vehicles, and the subsequent decrease in the number of horses on pasture, the old 'white outs' of years gone by are becoming rare events. This species is rarely found in woodland.",
       "appearance": "The cap is white, may have fine scales, and is 5 to 10 centimetres (2.0 to 3.9 in) in diameter; it is first hemispherical in shape before flattening out with maturity. The gills are initially pink, then red-brown and finally a dark brown, as is the spore print. The 3 to 10 centimetres (1.2 to 3.9 in) tall stipe is predominantly white and bears a single thin ring. The taste is mild. The white flesh bruises a dingy reddish brown, as opposed to yellow in the inedible (and somewhat toxic) Agaricus xanthodermus and similar species. The thick-walled, elliptical spores measure 5.5–8.0 μm by 4–5 μm. Cheilocystidia are absent.",
       "imageName": "meadow-mushroom1",
       "funFact": "Several species may be confused with Agaricus campestris. The most dangerous confusion may be with Amanita virosa, which is morbidly toxic, or with the deadly Amanita hygroscopica or 'Pink-Gilled Destroying Angel'.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/Agaricus_campestris#/media/File:Agaricus_campestris.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:2012-02-13_Agaricus_campestris_L_199587.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Agaricus_campestris",
       "category":"choice",
       "map":"meadow-mushroom-map",
       "chart":"meadow-mushroom-chart",
       "gbif":"https://www.gbif.org/species/5243458"

   },
   {
       "id": 1028,
       "name": "Morel Mushroom",
       "scientificName": "Morchella",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Morchellaceae",
       "description": "Morchella, the true morels, is a genus of edible sac fungi closely related to anatomically simpler cup fungi in the order Pezizales (division Ascomycota). These distinctive fungi have a honeycomb appearance due to the network of ridges with pits composing their caps. Morels are prized by gourmet cooks, particularly in French cuisine. Due to difficulties in cultivation, commercial harvesting of wild morels has become a multimillion-dollar industry in the temperate Northern Hemisphere, in particular North America, Turkey, China, the Himalayas, India, and Pakistan and Kashmir where these highly prized fungi are found in abundance.",
       "appearance": "The fruit bodies of Morchella species are highly polymorphic, varying in shape, color and size, while in many cases they do not exhibit clear-cut distinguishing features microscopically; this has historically contributed to uncertainties in taxonomy. Discriminating between the various taxa described, is further hindered by uncertainty over which of these are truly biologically distinct. Remarkably, some authors in the past had suggested that the genus contains as few as 3 to 6 species, while others recognised as many as 34. Many species appear to form symbiotic or endophytic relationships with trees, while others appear to act as saprotrophs. Yellow morels (Morchella esculenta and related species) are more commonly found under deciduous trees rather than conifers, while black morels (Morchella elata and related species) are mostly found in coniferous forests, disturbed ground and recently burned areas. Morchella galilaea, and occasionally Morchella rufobrunnea, appear to fruit in the autumn or winter months rather than spring, which is the typical fruiting season for morels.",
       "imageName": "morel1",
       "funFact": "Certain Morchella species (M. eximia, M. importuna, M. tomentosa and others) exhibit a pyrophilic behaviour and may grow abundantly in forests which have been recently burned by a fire. Moderate-intensity fires are reported to produce higher abundances of morels than low- or high-intensity fires. This is caused by the soil becoming more alkaline as the result of wood ash combining with water and being absorbed into the soil which triggers the morels to fruit.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/Morchella#/media/File:White_Morel_IMG_0399.JPG",
       "image2": "https://commons.wikimedia.org/wiki/File:Morchella_esculenta_84915.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Morchella",
       "category":"choice",
       "map":"morel-mushroom-map",
       "chart":"morel-mushroom-chart",
       "gbif":"https://www.gbif.org/species/2594601"

   },
   {
       "id": 1029,
       "name": "Pig's Ears",
       "scientificName": "Gomphus clavatus",
       "edible": "Use Caution",
       "gourmet": "Not Choice",
       "family": "Gomphaceae",
       "description": "Gomphus clavatus, commonly known as pig's ears or the violet chanterelle, is an edible species of fungus in the genus Gomphus native to Eurasia and North America. Described by Jacob Christian Schäffer in 1774, G. clavatus has had several name changes and many alternative scientific names, having been classified in the genus Cantharellus (also called chanterelles), though it is not closely related to them. Typically found in coniferous forests, G. clavatus is mycorrhizal, and is associated with tree species in a variety of coniferous genera, particularly spruces and firs. It is more common at elevations of greater than 2,000 ft (600 m), in moist, shady areas with plenty of leaf litter. ",
       "appearance": "The fruit body is vase- or fan-shaped with wavy edges to its rim, and grows up to 15–16 cm (6–6 1⁄4 in) wide and 17 cm (6 3⁄4 in) tall. The upper surface or cap is orangish-brown to lilac, while the lower spore-bearing surface, the hymenium, is covered in wrinkles and ridges rather than gills or pores, and is a distinctive purple color.",
       "imageName": "pigs-ears1",
       "funFact": "In Europe, Gomphus clavatus appears on the national Red Lists of threatened fungi in 17 countries and is one of 33 species of fungi proposed for international conservation under the Bern Convention.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Gomphus_clavatus#/media/File:Gomphus_clavatus_II_Totes_Gebirge.jpg",
       "image2": "https://en.wikipedia.org/wiki/Gomphus_clavatus#/media/File:Gomphus_clavatus_Fairy_ring.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Gomphus_clavatus",
       "category":"use caution",
       "map":"pigs-ears-map",
       "chart":"pigs-ear-chart",
       "gbif":"https://www.gbif.org/species/5238786"

   },
   {
       "id": 1030,
       "name": "Porcini",
       "scientificName": "Boletus edulis",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Boletaceae",
       "description": "Boletus edulis (English: cep, penny bun, porcino or porcini) is a basidiomycete fungus, and the type species of the genus Boletus. Widely distributed in the Northern Hemisphere across Europe, Asia, and North America, it does not occur naturally in the Southern Hemisphere, although it has been introduced to southern Africa, Australia, New Zealand, and Brazil. Several closely related European mushrooms formerly thought to be varieties or forms of B. edulis have been shown using molecular phylogenetic analysis to be distinct species, and others previously classed as separate species are conspecific with this species. The western North American species commonly known as the California king bolete (Boletus edulis var. grandedulis) is a large, darker-coloured variant first formally identified in 2007.",
       "appearance": "The fungus grows in deciduous and coniferous forests and tree plantations, forming symbiotic ectomycorrhizal associations with living trees by enveloping the tree's underground roots with sheaths of fungal tissue. The fungus produces spore-bearing fruit bodies above ground in summer and autumn. The fruit body has a large brown cap which on occasion can reach 35 cm (14 in) in diameter and 3 kg (6 lb 10 oz) in weight. Like other boletes, it has tubes extending downward from the underside of the cap, rather than gills; spores escape at maturity through the tube openings, or pores. The pore surface of the B. edulis fruit body is whitish when young, but ages to a greenish-yellow. The stout stipe, or stem, is white or yellowish in colour, up to 25 cm (10 in) tall and 10 cm (4 in) thick, and partially covered with a raised network pattern, or reticulations.",
       "imageName": "porcini1",
       "funFact": "Prized as an ingredient in various culinary dishes, B. edulis is an edible mushroom held in high regard in many cuisines, and is commonly prepared and eaten in soups, pasta, or risotto. The mushroom is low in fat and digestible carbohydrates, and high in protein, vitamins, minerals and dietary fibre. Although it is sold commercially, it is very difficult to cultivate.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/Boletus_edulis#/media/File:Boletus_edulis_EtgHollande_041031_091.jpg",
       "image2": "https://en.wikipedia.org/wiki/Boletus_edulis#/media/File:Boletus_edulis_var._grandedulis_27911.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Boletus_edulis",
       "category":"choice",
       "map":"porcini-map",
       "chart":"porcini-chart",
       "gbif":"https://www.gbif.org/species/5954958"

   },
   {
       "id": 1031,
       "name": "Reishi",
       "scientificName": "Ganoderma lingzhi",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Ganodermataceae",
       "description": "Lingzhi, Ganoderma lingzhi, also known as reishi, is a polypore fungus ('bracket fungus') belonging to the genus Ganoderma. The lingzhi mushroom is used in traditional Chinese medicine. There is insufficient evidence that consuming lingzhi mushrooms or their extracts has an effect on cancer, metabolic diseases or cardiovascular diseases. In nature, it grows at the base and stumps of deciduous trees, especially that of the maple. Only two or three out of 10,000 such aged trees will have lingzhi growth, and therefore its wild form is rare. Lingzhi may be cultivated on hardwood logs, sawdust or woodchips.",
       "appearance": "Its red-varnished, kidney-shaped cap and peripherally inserted stem gives it a distinct fan-like appearance. When fresh, the lingzhi is soft, cork-like, and flat. It lacks gills on its underside, and instead releases its spores via fine pores. Depending on the age, the pores on its underside may be white or brown.",
       "imageName": "reishi1",
       "funFact": "Lingzhi, also known as reishi, is the ancient 'mushroom of immortality', revered for over 2,000 years. Uncertainty exists about which Ganoderma species was most widely utilized as lingzhi mushroom in ancient times, and likely a few different common species were considered interchangeable.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Trees", "Dead Wood", "Cultivated"],
       "image1": "https://en.wikipedia.org/wiki/Lingzhi_(mushroom)#/media/File:Ganoderma_lucidum_01.jpg",
       "image2": "https://en.wikipedia.org/wiki/Lingzhi_(mushroom)#/media/File:Jreishi2.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Lingzhi_(mushroom)",
       "category":"choice",
       "map":"reishi-map",
       "chart":"reishi-chart",
       "gbif":"https://www.gbif.org/species/2519220"

   },
   {
       "id": 1032,
       "name": "The Sickener",
       "scientificName": "Russula emetica",
       "edible": "Poisonous",
       "gourmet": "Not Choice",
       "family": "Russulaceae",
       "description": "Russula emetica, commonly known as the sickener, emetic russula, or vomiting russula, is a basidiomycete mushroom, and the type species of the genus Russula. The mushroom's common names refer to the gastrointestinal distress they cause when consumed raw. The flesh is extremely peppery, but this offensive taste, along with its toxicity, can be removed by parboiling or pickling. Although it used to be widely eaten in Russia and eastern European countries, it is generally not recommended for consumption.",
       "appearance": " It has a red, convex to flat cap up to 8.5 cm (3.3 in) in diameter, with a cuticle that can be peeled off almost to the centre. The gills are white to pale cream, and closely spaced. A smooth white stem measures up to 10.5 cm (4.1 in) long and 2.4 cm (0.9 in) thick. First described in 1774, the mushroom has a wide distribution in the Northern Hemisphere, where it grows on the ground in damp woodlands in a mycorrhizal association with conifers, especially pine.",
       "imageName": "the-sickener1",
       "funFact": "There are many similar Russula species that have a red cap with white stem and gills, some of which can be reliably distinguished from R. emetica only by microscopic characteristics.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Russula_emetica#/media/File:Russula_emetica_in_Poland.jpg",
       "image2": "https://en.wikipedia.org/wiki/Russula_emetica#/media/File:Tiny_Russula_paludosa_(Appelrussula)_at_Rozendaal_castle_park_-_panoramio.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Russula_emetica",
       "category":"poisonous",
       "map":"the-sickener-map",
       "chart":"the-sickener-chart",
       "gbif":"https://www.gbif.org/species/2551213"

   },
   {
       "id": 1033,
       "name": "Shaggy Mane",
       "scientificName": "Coprinus comatus",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Agaricaceae",
       "description": "Coprinus comatus, the shaggy ink cap, lawyer's wig, or shaggy mane, is a common fungus often seen growing on lawns, along gravel roads and waste areas. When young it is an excellent edible mushroom provided that it is eaten soon after being collected (it keeps very badly because of the autodigestion of its gills and cap). If long-term storage is desired, microwaving, sauteing or simmering until limp will allow the mushrooms to be stored in a refrigerator for several days or frozen. Also, placing the mushrooms in a glass of ice water will delay the decomposition for a day or two so that one has time to incorporate them into a meal. Processing or icing must be done whether for eating or storage within four to six hours of harvest to prevent undesirable changes to the mushroom. The species is cultivated in China as food.",
       "appearance": "The young fruit bodies first appear as white cylinders emerging from the ground, then the bell-shaped caps open out. The caps are white, and covered with scales—this is the origin of the common names of the fungus. The gills beneath the cap are white, then pink, then turn black and secrete a black liquid filled with spores (hence the 'ink cap' name). This mushroom is unusual because it will turn black and dissolve itself in a matter of hours after being picked or depositing spores.",
       "imageName": "shaggy-mane1",
       "funFact": "The mushroom can sometimes be confused with the magpie fungus which is poisonous. In America, the 'vomiter' mushroom Chlorophyllum molybdites is responsible for most cases of mushroom poisoning due to its similarity with shaggy mane and other edible mushrooms.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/Coprinus_comatus#/media/File:Coprinus_comatus_G4.JPG",
       "image2": "https://en.wikipedia.org/wiki/Coprinus_comatus#/media/File:Coprinus_comatus-2_hg.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Coprinus_comatus",
       "category":"choice",
       "map":"shaggy-mane-map",
       "chart":"shaggy-mane-chart",
       "gbif":"https://www.gbif.org/species/7987658"

   },
   {
       "id": 1034,
       "name": "Slippery Jack",
       "scientificName": "Suillus luteus",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Suillaceae",
       "description": "Suillus luteus is a bolete fungus, and the type species of the genus Suillus. A common fungus native to Eurasia, from the British Isles to Korea, it has been introduced widely elsewhere, including North and South America, southern Africa, Australia and New Zealand. Commonly referred to as slippery jack or sticky bun in English-speaking countries, its names refer to the brown cap, which is characteristically slimy in wet conditions. The fungus, initially described as Boletus luteus by Carl Linnaeus in 1753, is now classified in a different family as well as genus. Suillus luteus is edible, though not as highly regarded as other bolete mushrooms, and is commonly prepared and eaten in soups, stews or fried dishes. The slime coating, however, may cause indigestion if not removed before eating.",
       "appearance": "The fungus produces spore-bearing fruit bodies, often in large numbers, above ground in summer and autumn. The fruit body cap often has a distinctive conical shape before flattening with age, reaching up to 13 cm (5 in) in diameter. Like other boletes, it has tubes extending downward from the underside of the cap, rather than gills; spores escape at maturity through the tube openings, or pores. The pore surface is yellow, and covered by a membranous partial veil when young. The pale stipe, or stem, measures up to 10 cm (4 in) tall and 3 cm (1.2 in) thick and bears small dots near the top. Unlike most other boletes, it bears a distinctive membranous ring that is tinged brown to violet on the underside.",
       "imageName": "slippery-jack1",
       "funFact": "The fungus grows in coniferous forests in its native range, and pine plantations in countries where it has become naturalized. It forms symbiotic ectomycorrhizal associations with living trees by enveloping the tree's underground roots with sheaths of fungal tissue.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Suillus_luteus#/media/File:Suillus_luteus_475376.jpg",
       "image2": "https://en.wikipedia.org/wiki/Suillus_luteus#/media/File:2012-10-12_Suillus_luteus_(L.)_Roussel_271431.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Suillus_luteus",
       "category":"edible",
       "map":"slippery-jack-map",
       "chart":"slippery-jack-chart",
       "gbif":"https://www.gbif.org/species/7777157"

   },
   {
       "id": 1035,
       "name": "Snow Fungus",
       "scientificName": "Tremella fuciformis",
       "edible": "Use Caution",
       "gourmet": "Not Choice",
       "family": "Tremellaceae",
       "description": "Tremella fuciformis is a species of fungus; it produces white, frond-like, gelatinous basidiocarps (fruiting bodies). It is widespread, especially in the tropics, where it can be found on the dead branches of broadleaf trees. This fungus is commercially cultivated and is one of the most popular fungi in the cuisine and medicine of China. Tremella fuciformis is commonly known as snow fungus, snow ear, silver ear fungus, and white jelly mushroom.",
       "appearance": "Tremella fuciformis is a parasitic yeast, and grows as a slimy, mucous-like film until it encounters its preferred hosts, various species of Annulohypoxylon (or possibly Hypoxylon) fungi, whereupon it then invades, triggering the aggressive mycelial growth required to form the fruiting bodies. Fruit bodies are gelatinous, watery white, up to 7.5 centimetres (3 inches) across (larger in cultivated specimens), and composed of thin but erect, seaweed-like, branching fronds, often crisped at the edges.",
       "imageName": "snow-fungus1",
       "funFact": "In Chinese cuisine, Tremella fuciformis is traditionally used in sweet dishes. While tasteless, it is valued for its gelatinous texture as well as its supposed medicinal benefits.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Trees", "Dead Wood", "Cultivated"],
       "image1": "https://en.wikipedia.org/wiki/Tremella_fuciformis#/media/File:Tremella_fuciformis_337510.jpg",
       "image2": "https://en.wikipedia.org/wiki/Tremella_fuciformis#/media/File:Eunibeoseot_(Tremella_fuciformis)_silver_ear_mushroom.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Tremella_fuciformis",
       "category":"use caution",
       "map":"snow-fungus-map",
       "chart":"snow-fungus-chart",
       "gbif":"https://www.gbif.org/species/5237434"

   },
   {
       "id": 1036,
       "name": "Paddy Straw Mushrooms",
       "scientificName": "Volvariella volvacea",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Pluteaceae",
       "description": "Volvariella volvacea (also known as paddy straw mushroom or straw mushroom) is a species of edible mushroom cultivated throughout East and Southeast Asia and used extensively in Asian cuisines. They are often available fresh in regions they are cultivated, but elsewhere are more frequently found canned or dried. Worldwide, straw mushrooms are the third most consumed mushroom.",
       "appearance": "In their button stage, straw mushrooms resemble poisonous death caps, but can be distinguished by several mycological features, including their pink spore print (spore prints of death caps are white). The two mushrooms have different distributions, with the death cap generally not found where the straw mushroom grows natively, but immigrants, particularly those from Southeast Asia to California and Australia, have been poisoned due to misidentification.",
       "imageName": "paddy-straw1",
       "funFact": "Straw mushrooms are grown on rice straw beds and are most commonly picked when immature (often labeled 'unpeeled'), during their button or egg phase and before the veil ruptures",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Forest Floor", "Dead Wood", "Cultivated"],
       "image1": "https://en.wikipedia.org/wiki/Volvariella_volvacea#/media/File:StrawMushroom.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:HK_food_%E8%8D%89%E8%8F%87_Volvariella_volvacea_Straw_Mushroom_May-2012.JPG",
       "wiki": "https://en.wikipedia.org/wiki/Volvariella_volvacea",
       "category":"choice",
       "map":"paddy-straw-map",
       "chart":"paddy-straw-mushroom-chart",
       "gbif":"https://www.gbif.org/species/5241445"

   },
   {
       "id": 1037,
       "name": "Club Coral",
       "scientificName": "Clavariadelphus truncatus",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Gomphaceae",
       "description": "Clavariadelphus truncatus is a species of mushroom. The common name of the species is club coral. It is a member of the basidiomycete fungi family Gomphaceae. The mushroom's habitat is in coniferous forests from summer to autumn. The mushroom is a common species. The species is found at a high elevation and is widely distributed. C. truncatus can bioaccumulate significant amounts of zinc, and radioactive caesium-137. The mushroom has a pleasant odor and a sweet taste.",
       "appearance": "The species has a fruiting body in the shape of a club. The flesh is white, thin, and hollow at the top. The vertical side of the fruiting body normally has folds and wrinkles, but can be smooth. The spores are smooth and their spore print is pale yellow to ochre. The yellow chanterelle is distantly related to the mushroom and looks nearly the same, except for the ridges and cross-veined hymenium. One field guide says that it is unlikely that anyone would confuse the mushroom with another species.",
       "imageName": "club-coral1",
       "funFact": "The mushroom contains clavaric acid, which has been shown to reduce the rate of tumor development when given to mice. Clavaric acid interferes with farnesyltransferase, an enzyme implicated in tumorigenesis, which suggests that clavaric acid may have therapeutic value in the treatment of certain cancers.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Clavariadelphus_truncatus#/media/File:Clavariadelphus_truncatus_69586.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Clavariadelphus_truncatus.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Clavariadelphus_truncatus",
       "category":"edible",
       "map":"club-coral-map",
       "chart":"club-coral-chart",
       "gbif":"https://www.gbif.org/species/2521401"

   },
   {
       "id": 1038,
       "name": "Termitomyces",
       "scientificName": "Termitomyces reticulatus",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Lyophyllaceae",
       "description": "Termitomyces is a genus of basidiomycete fungi belonging to the family Lyophyllaceae. There are 30-40 species in the genus, all of which are completely dependent on termites to survive. They are the food source for a subfamily of termites, the Macrotermitinae, who enjoy an obligate symbiosis with the genus similar to that between Atta ants and Attamyces mushrooms. Despite this relationship, spore transfer is still accomplished mainly by shedding from mushrooms, which protrude from the termite mounds.",
       "appearance": "These mushrooms are edible for most people, and the larger species are a popular wild food where they occur. They include the largest edible mushroom in the world, Termitomyces titanicus of West Africa and Zambia, whose cap reaches 1 metre (3.28ft) in diameter. These fungi grow on 'combs' which are formed from the termites' excreta, dominated by tough woody fragments. Termitomyces was described by Roger Heim in 1942.",
       "imageName": "termitomyces1",
       "funFact": "This genus is a popular seasonal delicacy in the Indian state of Goa. For about two weeks at the beginning of August every year, clusters of villagers dot the Goan roadside hawking the handpicked mushrooms. A spicy gravy known as 'Tonak' is a popular method of preparation. Since Termitomyces mushrooms are difficult to mass produce, they command a high price.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Termitomyces#/media/File:Termitomyces_reticulatus_37340.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Termitomyces_titanicus.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Termitomyces",
       "category":"edible",
       "map":"termitomyces-map",
       "chart":"termitomyces-chart",
       "gbif":"https://www.gbif.org/species/2530595"

   },
   {
       "id": 1039,
       "name": "Turkey Tail",
       "scientificName": "Trametes versicolor",
       "edible": "Not Edible",
       "gourmet": "Not Choice",
       "family": "Polyporaceae",
       "description": "Trametes versicolor – also known as Coriolus versicolor and Polyporus versicolor – is a common polypore mushroom found throughout the world. Meaning 'of several colors', versicolor reliably describes this fungus that displays different colors. For example, because its shape and multiple colors are similar to those of a wild turkey, T. versicolor is commonly called turkey tail. A similar looking mushroom, commonly called false turkey tail, which is from a different order, may sometimes be confused with the turkey tail mushroom due to appearance. Another lookalike is the multicolor gill polypore.",
       "appearance": "The top surface of the cap shows typical concentric zones of different colors, and the margin is always the lightest. The flesh is 1–3 mm thick and has leathery texture. Older specimens, such as the one pictured, can have zones with green algae growing on them, thus appearing green. It commonly grows in tiled layers on in groups or rows on logs and stumps of deciduous trees, and is very common in North America. The mushroom is stalkless and the cap is rust-brown or darker brown, sometimes with blackish zones. The cap is flat, up to 8 × 5 x 0.5–1 cm in area. It is often triangular or round, with zones of fine hairs. The pore surface is whitish to light brown, with pores round and with age twisted and labyrinthine. 3–8 pores per millimeter.",
       "imageName": "turkey-tail1",
       "funFact": "It may be eaten by caterpillars of the fungus moth Nemaxera betulinella and by maggots of the Platypezid fly Polyporivora picta. and the fungus gnat Mycetophila luctuosa, but is considered inedible to humans.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Trees", "Dead Wood", ""],
       "image1": "https://en.wikipedia.org/wiki/Trametes_versicolor#/media/File:Trametes_versicolor_G4_(1).JPG",
       "image2": "https://en.wikipedia.org/wiki/Trametes_versicolor#/media/File:Schmetterlingstramete_Trametes_versicolor_001.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Trametes_versicolor",
       "category":"inedible",
       "map":"",
       "chart":"turkey-tail-chart",
       "gbif":"https://www.gbif.org/species/2548311"

   },
   {
       "id": 1040,
       "name": "Garden Giant",
       "scientificName": "Stropharia rugosoannulata",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Strophariaceae",
       "description": "Stropharia rugosoannulata, commonly known as the wine cap stropharia, 'garden giant', burgundy mushroom or king stropharia, is an agaric of the family Strophariaceae found in Europe and North America, and introduced to Australia and New Zealand. Unlike many other members of the genus Stropharia, it is regarded as a choice edible and is commercially cultivated.",
       "appearance": "The king stropharia can grow to 20 cm high with a reddish-brown convex to flattening cap up to 30 cm across, the size leading to another colloquial name godzilla mushroom. The gills are initially pale, then grey, and finally dark purple-brown in colour. The firm flesh is white, as is the tall stem which bears a wrinkled ring. This is the origin of the specific epithet which means 'wrinkled-ringed'.",
       "imageName": "garden-giant1",
       "funFact": "It is found on wood chips across North America in summer and autumn. Described as very tasty by some authors, king stropharia is easily cultivated on a medium similar to that on which it grows naturally. Antonio Carluccio recommends sautéeing them in butter or grilling them.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Forest Floor", "Dead Wood", "Cultivated"],
       "image1": "https://en.wikipedia.org/wiki/Stropharia_rugosoannulata#/media/File:2011-05-19_Stropharia_rugosoannulata_Farl._ex_Murrill_183478.jpghttps://en.wikipedia.org/wiki/Stropharia_rugosoannulata#/media/File:2011-05-19_Stropharia_rugosoannulata_Farl._ex_Murrill_183478.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Kulturtr%C3%A4uschling_Stropharia_rugosoannulata.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Stropharia_rugosoannulata",
       "category":"choice",
       "map":"garden-giant-map",
       "chart":"garden-giant-chart",
       "gbif":"https://www.gbif.org/species/2533347"

   },
   {
       "id": 1041,
       "name": "Wood Blewit",
       "scientificName": "Clitocybe nuda",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Tricholomataceae",
       "description": "Clitocybe nuda, commonly known as the wood blewit and alternately described as Lepista nuda, is an edible mushroom native to Europe and North America. Described by Pierre Bulliard in 1790, it was also known as Tricholoma nudum for many years. It is found in both coniferous and deciduous woodlands. It is a fairly distinctive mushroom that is widely eaten, though there is some caution about edibility. Nevertheless, it has been cultivated in Britain, the Netherlands and France.",
       "appearance": "This mushroom can range from lilac to purple-pink. Some North American specimens are duller and tend toward tan, but usually have purplish tones on the stem and gills. The gills are attached to the short, stout stem. Mature specimens have a darker color and flatter cap; younger ones are lighter with more convex caps. Wood blewits have a very distinctive odor, which has been likened by one author to that of frozen orange juice.",
       "imageName": "wood-blewit1",
       "funFact": "The wood blewit has been cultivated in Britain, the Netherlands and France. Cultivated wood blewits are said not to taste as good as wild wood blewits.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Forest Floor", "Cultivated", ""],
       "image1": "https://en.wikipedia.org/wiki/Clitocybe_nuda#/media/File:Lepista_nuda_LC0372.jpg",
       "image2": "https://en.wikipedia.org/wiki/Clitocybe_nuda#/media/File:Lepista_nuda_Paarse_schijnridderzwam.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Clitocybe_nuda",
       "category":"choice",
       "map":"wood-blewit-map",
       "chart":"wood-blewit-chart",
       "gbif":"https://www.gbif.org/species/5242048"

   },
   {
       "id": 1042,
       "name": "Wood Ear",
       "scientificName": "Auricularia auricula-judae",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Auriculariaceae",
       "description": "Auricularia auricula-judae, known most commonly as Jew's ear or (black) wood ear (alternatively, black fungus, jelly ear, or by a number of other common names), is a species of edible Auriculariales fungus found worldwide. The fruiting body is distinguished by its noticeably ear-like shape and brown colouration; it grows upon wood, especially elder. Its specific epithet is derived from the belief that Judas Iscariot hanged himself from an elder tree; the common name 'Judas's ear' was largely eclipsed by the corruption 'Jew's ear', while today 'wood ear', 'jelly ear' and other names are sometimes used.",
       "appearance": "The fungus can be found throughout the year in temperate regions worldwide, where it grows upon both dead and living wood. The fruit body of A. auricula-judae is normally 3 to 8 centimetres (1 to 3 inches) across, but can be as much as 12 centimetres (4 1⁄2 inches). It is distinctively shaped, typically being reminiscent of a floppy ear, though the fruit bodies can also be cup-shaped. It is normally attached to the substrate laterally and sometimes by a very short stalk. The species has a tough, gelatinous, elastic texture when fresh, but it dries hard and brittle.",
       "imageName": "wood-ear1",
       "funFact": "Auricularia auricula-judae grows upon the wood of deciduous trees and shrubs, favouring elder. In up to 90% of cases, the mushroom is found on elder, but it is often incorrectly assumed to grow exclusively on elder.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "Dead Wood", ""],
       "image1": "https://en.wikipedia.org/wiki/Auricularia_auricula-judae#/media/File:Auricularia_auricula-judae_64485.JPG",
       "image2": "https://en.wikipedia.org/wiki/Auricularia_auricula-judae#/media/File:Auricularia_auricula-judae_(xndr).jpg",
       "wiki": "https://en.wikipedia.org/wiki/Auricularia_auricula-judae",
       "category":"choice",
       "map":"wood-ear-map",
       "chart":"wood-ear-chart",
       "gbif":"https://www.gbif.org/species/5249271"

   },
   {
       "id": 1043,
       "name": "Death Cap",
       "scientificName": "Amanita phalloides",
       "edible": "Poisonous",
       "gourmet": "Not Choice",
       "family": "Amanitaceae",
       "description": "Amanita phalloides, commonly known as the death cap, is a deadly poisonous basidiomycete fungus, one of many in the genus Amanita. Widely distributed across Europe, but now sprouting in other parts of the world, A. phalloides forms ectomycorrhizas with various broadleaved trees. In some cases, the death cap has been introduced to new regions with the cultivation of non-native species of oak, chestnut, and pine. The large fruiting bodies (mushrooms) appear in summer and autumn; the caps are generally greenish in colour with a white stipe and gills. ",
       "appearance": "The death cap has a large and imposing epigeous (aboveground) fruiting body (basidiocarp), usually with a pileus (cap) from 5 to 15 cm (2 to 6 in) across, initially rounded and hemispherical, but flattening with age. The color of the cap can be pale-, yellowish-, or olive-green, often paler toward the margins and often paler after rain. The cap surface is sticky when wet and easily peeled, a troublesome feature, as that is allegedly a feature of edible fungi. The remains of the partial veil are seen as a skirtlike, floppy annulus usually about 1.0 to 1.5 cm (0.39 to 0.59 in) below the cap. The crowded white lamellae (gills) are free. The stipe is white with a scattering of grayish-olive scales and is 8 to 15 cm (3 to 6 in) long and 1 to 2 centimetres (3⁄8 to 3⁄4 in) thick, with a swollen, ragged, sac-like white volva (base). As the volva, which may be hidden by leaf litter, is a distinctive and diagnostic feature, it is important to remove some debris to check for it.",
       "imageName": "death-cap1",
       "funFact": "As the common name suggests, the fungus is highly toxic, and is responsible for the majority of fatal mushroom poisonings worldwide. Its biochemistry has been researched intensively for decades, and 30 grams (1.1 ounces), or half a cap, of this mushroom is estimated to be enough to kill a human.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Amanita_phalloides#/media/File:Amanita_phalloides_1.JPG",
       "image2": "https://commons.wikimedia.org/wiki/File:Amanita_phalloides_Kiev3.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Amanita_phalloides",
       "category":"poisonous",
       "map":"death-cap-map",
       "chart":"death-cap-chart",
       "gbif":"https://www.gbif.org/species/5240325"

   },
   {
       "id": 1044,
       "name": "Conocybe filaris",
       "scientificName": "Pholiotina rugosa",
       "edible": "Poisonous",
       "gourmet": "Not Choice",
       "family": "Bolbitiaceae",
       "description": "Pholiotina rugosa is a common lawn mushroom which is widely distributed and especially common in the Pacific Northwest. It also grows on woodchips, rich soil and compost. It has been found in Europe, Asia and North America. It contains the same mycotoxins as the death cap. It is more commonly known as Conocybe filaris as this is the name it is likely to appear under in field guides. This species is deadly poisonous. They have been shown to contain amatoxins, which are highly toxic to the liver and are responsible for many deaths by poisoning from mushrooms in the genera Amanita and Lepiota.",
       "appearance": "Pholiotina rugosa has a cap which is conical, expanding to flat, usually with an umbo. It is less than 3 cm across, has a smooth brown top, and the margin is often striate. The gills are rusty brown, close, and adnexed. The stalk is 2 mm thick and 1 to 6 cm long, smooth, and brown, with a prominent and movable ring. The spore print is rusty brown.",
       "imageName": "conocybe-filaris2",
       "funFact": "Pholiotina rugosa is sometimes mistaken for Psilocybe, especially Psilocybe cyanescens and Psilocybe subaeruginosa species due to their similar looking pileus (cap).",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Pholiotina_rugosa#/media/File:Pholiotina_rugosa_62373.jpg",
       "image2": "https://commons.m.wikimedia.org/wiki/File:Conocybe_rugosa_(Peck)_Watling_944497.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Pholiotina_rugosa",
       "category":"poisonous",
       "map":"conocybe-filaris-map",
       "chart":"conocybe-filaris-chart",
       "gbif":"https://www.gbif.org/species/2529908"

   },
   {
       "id": 1045,
       "name": "Deadly Webcap",
       "scientificName": "Cortinarius rubellus",
       "edible": "Poisonous",
       "gourmet": "Not Choice",
       "family": "Cortinariaceae",
       "description": "Cortinarius rubellus, commonly known as the deadly webcap, is a species of fungus in the family Cortinariaceae, native to high-latitude temperate to subalpine forests of Eurasia and North America. Within the genus it belongs to a group known as the Orellani, all of which are highly toxic—eating them results in kidney failure, which is often irreversible.",
       "appearance": "Cortinarius rubellus has a conical to convex (partly flattening to umbonate with maturity) cap of 2.5 to 8 centimetres (1 to 3 1⁄4 in) diameter. In colour, it is a tawny to date brown with paler margins, and is covered in fine, fibrous scales. The gills are ochre- or caramel-coloured, changing to a deeper brown with age as the spores mature. They have an adnate connection to the stipe. The stipe is 5.5 to 11 centimetres (2 1⁄4 to 4 1⁄4 in) tall, and 0.5 to 1.5 centimetres (1⁄4 to 5⁄8 in) thick with a bulbous base. It is the same colour or slightly paler than the cap, and can have yellow fragments of the veil (cortina) attached to its lower half. The flesh is cream or pale yellow, but more tan below the pileipellis and in the stem base. It smells slightly of radishes and has no strong taste.",
       "imageName": "deadly-webcap1",
       "funFact": "C. rubellus has been recorded in high-latitude temperate to subalpine forests throughout the northern hemisphere, including subalpine conifer forest in the Yatsugatake Mountains in Yamanashi Prefecture, central Japan. In North America, it is found in British Columbia and western Washington, particularly Mount Rainier National Park",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://commons.wikimedia.org/wiki/File:2006-07-12_Cortinarius_rubellus_2.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Cortinarius_rubellus_02.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Cortinarius_rubellus",
       "category":"poisonous",
       "map":"deadly-webcap-map",
       "chart":"deadly-webcap-chart",
       "gbif":"https://www.gbif.org/species/2528663"

   },
   {
       "id": 1046,
       "name": "Deadly Skullcap",
       "scientificName": "Galerina marginata",
       "edible": "Poisonous",
       "gourmet": "Not Choice",
       "family": "Hymenogastraceae",
       "description": "Galerina marginata is widespread in the Northern Hemisphere, including Europe, North America, and Asia, and has also been found in Australia. It is a wood-rotting fungus that grows predominantly on decaying conifer wood. An extremely poisonous species, it contains the same deadly amatoxins found in the death cap (Amanita phalloides). Ingestion in toxic amounts causes severe liver damage with vomiting, diarrhea, hypothermia, and eventual death if not treated rapidly. About ten poisonings have been attributed to the species now grouped as G. marginata over the last century.",
       "appearance": "The fruit bodies of this fungus have brown to yellow-brown caps that fade in color when drying. The gills are brownish and give a rusty spore print. A well-defined membranous ring is typically seen on the stems of young specimens but often disappears with age. In older fruit bodies, the caps are flatter and the gills and stems browner. The species is a classic 'little brown mushroom'—a catchall category that includes all small to medium-sized, hard-to-identify brownish mushrooms, and may be easily confused with several edible species. The cap reaches 1.7 to 4 cm (0.67 to 1.57 in) in diameter. It starts convex, sometimes broadly conical, and has edges (margins) that are curved in against the gills. As the cap grows and expands, it becomes broadly convex and then flattened, sometimes developing a central elevation, or umbo, which may project prominently from the cap surface. ",
       "imageName": "deadly-skullcap1",
       "funFact": "The toxins found in Galerina marginata are known as amatoxins. Amatoxins belong to a family of bicyclic octapeptide derivatives composed of an amino acid ring bridged by a sulfur atom and characterized by differences in their side groups; these compounds are responsible for more than 90% of fatal mushroom poisonings in humans. ",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "Trees", ""],
       "image1": "https://en.wikipedia.org/wiki/Galerina_marginata#/media/File:Galerina_marginata_Point_Reyes.jpg",
       "image2": "https://en.wikipedia.org/wiki/Galerina_marginata#/media/File:Galerina_marginata_63678.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Galerina_marginata",
       "category":"poisonous",
       "map":"deadly-skullcap-map",
       "chart":"deadly-skullcap-chart",
       "gbif":"https://www.gbif.org/species/8118872"

   },
   {
       "id": 1047,
       "name": "Destroying Angel",
       "scientificName": "Amanita bisporigera",
       "edible": "Poisonous",
       "gourmet": "Not Choice",
       "family": "Amanitaceae",
       "description": "The name destroying angel applies to several similar, closely related species of deadly all-white mushrooms in the genus Amanita. They are Amanita bisporigera and A. ocreata in eastern and western North America, and A. virosa in Europe. Another very similar species, A. verna or fool's mushroom, was first described in France. Young specimens like this are sometimes confused with puffballs or other non-deadly mushrooms. Destroying angels are among the most toxic known mushrooms; both they and the closely related death caps (A. phalloides) contain amatoxins.",
       "appearance": "The cap is usually about 5–12 centimetres (2–4 1⁄2 inches) across; the stipe is usually 7.5–20 cm (3–8 in) long and about 0.5–2 cm (1⁄4–3⁄4 in) thick. They are found singly or in small groups. Destroying angels are characterized by having a white stalk and gills. The cap can be pure white, or white at the edge and yellowish, pinkish, or tan at the center. It has a partial veil, or ring (annulus) circling the upper stalk, and the gills are 'free', not attached to the stalk. Perhaps the most telltale of the features is the presence of a volva, or universal veil, so called because it is a membrane that encapsulates the entire mushroom, rather like an egg, when it is very young. This structure breaks as the young mushroom expands, leaving parts that can be found at the base of the stalk as a boot or cuplike structure, and there may be patches of removable material on the cap surface. This combination of features, all found together in the same mushroom, is the hallmark of the family.",
       "imageName": "destroying-angel1",
       "funFact": "The destroying angel (Amanita bisporigera) and the death cap (Amanita phalloides) account for the overwhelming majority of deaths due to mushroom poisoning. Symptoms do not appear for 5 to 24 hours, by which time the toxins may already be absorbed and the damage (destruction of liver and kidney tissues) is irreversible. As little as half a mushroom cap can be fatal if the victim is not treated quickly enough.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "Dead Wood", ""],
       "image1": "https://en.wikipedia.org/wiki/Destroying_angel#/media/File:Destroying_Angel.jpg",
       "image2": "https://en.wikipedia.org/wiki/Destroying_angel#/media/File:Destroying_Angel_02.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Destroying_angel",
       "category":"poisonous",
       "map":"destroying-angel-map",
       "chart":"destroying-angel-chart",
       "gbif":"https://www.gbif.org/species/5452051"

   },
   {
       "id": 1048,
       "name": "Violet Webcap",
       "scientificName": "Cortinarius violaceus",
       "edible": "Not Edible",
       "gourmet": "Not Choice",
       "family": "Cortinariaceae",
       "description": "Cortinarius violaceus, commonly known as the violet webcap or violet cort, is a fungus in the webcap genus Cortinarius native across the Northern Hemisphere. Forming symbiotic (ectomycorrhizal) relationships with the roots of various plant species, C. violaceus is found predominantly in conifer forests in North America and deciduous forests in Europe. Though they are sometimes described as edible, the appearance of these mushrooms is more distinctive than their taste.",
       "appearance": "The fruit bodies are dark purple mushrooms with caps up to 15 cm (6 in) across, sporting gills underneath. The stalk measures 6 to 12 centimetres (2 1⁄3 to 4 2⁄3 in) by 1 to 2 centimetres (3⁄8 to 3⁄4 in), sometimes with a thicker base. The dark flesh has a smell reminiscent of cedar wood.",
       "imageName": "violet-webcap1",
       "funFact": "The destroying angel (Amanita bisporigera) and the death cap (Amanita phalloides) account for the overwhelming majority of deaths due to mushroom poisoning. Symptoms do not appear for 5 to 24 hours, by which time the toxins may already be absorbed and the damage (destruction of liver and kidney tissues) is irreversible. As little as half a mushroom cap can be fatal if the victim is not treated quickly enough.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Cortinarius_violaceus#/media/File:2008-08-22_Cortinarius_violaceus_(L.)_Gray_18241.jpg",
       "image2": "https://en.wikipedia.org/wiki/Cortinarius_violaceus#/media/File:Cortinarius_violaceus_G6.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Cortinarius_violaceus",
       "category":"inedible",
       "map":"violet-webcap-map",
       "chart":"violet-webcap-chart",
       "gbif":"https://www.gbif.org/species/2529040"

   },
   {
       "id": 1049,
       "name": "Carrot-footed Lepidella",
       "scientificName": "Amanita daucipes",
       "edible": "Not Edible",
       "gourmet": "Not Choice",
       "family": "Amanitaceae",
       "description": "Amanita daucipes is a species of fungus in the family Amanitaceae of the mushroom order Agaricales. Found exclusively in North America, the mushroom may be recognized in the field by the medium to large white caps with pale orange tints, and the dense covering of pale orange or reddish-brown powdery conical warts on the cap surface. The mushroom also has a characteristic large bulb at the base of its stem with a blunt short rooting base, whose shape is suggestive of the common names carrot-footed lepidella, carrot-foot amanita, or turnip-foot amanita. The mushroom has a strong odor that has been described variously as 'sweet and nauseous', or compared to an old ham bone, or soap. Edibility is unknown for the species, but consumption is generally not recommended due its position in the Amanita subgroup Lepidella, which contains some poisonous members.",
       "appearance": "The caps of the fruit bodies initially have a convex shape before flattening out in maturity, and measure 6 to 25 cm (2.4 to 9.8 in) in diameter. The cap surface is dry to shiny, and white with a pale orange hue. It is densely covered with white to pale orange or reddish-brown conical warts. The warts, remnants of the universal veil, are randomly distributed on the cap surface and become fluffier and cotton-like (flocculent) near the edge (or margin) of the cap. Drier specimens may have the cap surface completely cracked around the bases of the individual warts.",
       "imageName": "carrot-footed1",
       "funFact": "The edibility of A. daucipes is unknown, but the mushroom is not recommended for consumption because the Lepidella section of Amanita also contains several poisonous species.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Amanita_daucipes#/media/File:Amanita_daucipes_56224.jpg",
       "image2": "https://en.wikipedia.org/wiki/Amanita_daucipes#/media/File:Amanita_daucipes_18186.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Amanita_daucipes",
       "category":"inedible",
       "map":"carrot-footed-lepidella-map",
       "chart":"carrot-footed-lepidella-chart",
       "gbif":"https://www.gbif.org/species/8121028"

   },
   {
       "id": 1050,
       "name": "Pinecone Mushroom",
       "scientificName": "Auriscalpium vulgare",
       "edible": "Not Edible",
       "gourmet": "Not Choice",
       "family": "Auriscalpiaceae",
       "description": "Auriscalpium vulgare, commonly known as the pinecone mushroom, the cone tooth, or the ear-pick fungus, is a species of fungus in the family Auriscalpiaceae of the order Russulales. It was first described in 1753 by Carl Linnaeus, who included it as a member of the tooth fungi genus Hydnum, but British mycologist Samuel Frederick Gray recognized its uniqueness and in 1821 transferred it to the genus Auriscalpium that he created to contain it. The fungus is widely distributed in Europe, Central America, North America, and temperate Asia. Although common, its small size and nondescript colors lead it to be easily overlooked in the pine woods where it grows. A. vulgare is not generally considered edible because of its tough texture, but some historical literature says it used to be consumed in France and Italy.",
       "appearance": "The fruit body of A. vulgare is fibrous when fresh and becomes stiff when dry. It is a small species rarely exceeding 55 mm (2.2 in) in height, with a cap usually smaller than an adult's fingernails: 0.5 to 2 cm (0.2 to 0.8 in)—although it has been known to reach up to 4 cm (1.6 in). Auriscalpium vulgare usually has a single stem, but occasionally several stems arise from a thick common base. It attaches to the side of the cap and is cylindrical or slightly flattened with a bulbous base. Its surface is covered with hairy fibers (especially near the base), and its mature color is a dark chestnut brown. The cap is semicircular or kidney-shaped, flat on the lower surface and rounded on the top.",
       "imageName": "pinecone1",
       "funFact": "The fruit bodies (mushrooms) grow on conifer litter or on conifer cones that may be partially or completely buried in soil. The dark brown cap of the small, spoon-shaped mushroom is covered with fine brown hairs, and reaches a diameter of up to 2 cm (0.8 in)",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "Dead Wood", ""],
       "image1": "https://en.wikipedia.org/wiki/Auriscalpium_vulgare#/media/File:Auriscalpium_vulgare_82813.jpg",
       "image2": "https://en.wikipedia.org/wiki/Auriscalpium_vulgare#/media/File:Auriscalpium_vulgare_129877.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Auriscalpium_vulgare",
       "category":"inedible",
       "map":"pinecone-mushroom-map",
       "chart":"pinecone-mushroom-chart",
       "gbif":"https://www.gbif.org/species/5248458"

   },
   {
       "id": 1051,
       "name": "Yellow Fairy Cups",
       "scientificName": "Bisporella citrina",
       "edible": "Not Edible",
       "gourmet": "Not Choice",
       "family": "Helotiaceae",
       "description": "Bisporella citrina, commonly known as yellow fairy cups or lemon discos, is a species of fungus in the family Helotiaceae. The fungus produces tiny yellow cups up to 3 mm (0.12 in) in diameter, often without stalks, that fruit in groups or dense clusters on decaying deciduous wood that has lost its bark. The widely distributed species is found in North Africa, Asia, Europe, North America, and Central and South America. Found in late summer and autumn, the fungus is fairly common, but is easily overlooked owing to its small size. There are several similar species that can in most cases be distinguished by differences in color, morphology, or substrate. Microscopically, B. citrina can be distinguished from these lookalikes by its elliptical spores, which have a central partition, and an oil drop at each end.",
       "appearance": "Fruit bodies begin as spherical, closed globules, before expanding. The smooth, bright yellow fruit bodies are small—typically less than 3 mm (0.12 in) in diameter and up to 1 mm (0.04 in) high—and shallowly cup- or disc-shaped. The inner surface is smooth, and bright yellow, while the outer surface is a paler yellow. In mass, the spore color is white. The stalk is broad, pale yellow in color, and short to nearly absent; when present it is rarely more than 1 mm. The fruit bodies may be so numerous that their shapes are distorted by overcrowding. Fruit bodies that have dried are wrinkled and have a dull orangish-brown color. The fruit bodies have no distinctive taste nor odor, and are not edible.",
       "imageName": "yellow-fairy-cups1",
       "funFact": "Bisporella citrina is saprobic, and so obtains nutrients by breaking down complex organic molecules into simpler ones. Fruit bodies are typically encountered growing in dense clusters on the surface of rotten wood (especially deciduous trees), particularly beech.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Dead Wood", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Bisporella_citrina#/media/File:Dacrymyces_stillatus_Nees_63238.jpg",
       "image2": "https://en.wikipedia.org/wiki/Bisporella_citrina#/media/File:Lachnellula_arida_46999.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Bisporella_citrina",
       "category":"inedible",
       "map":"yellow-fairy-cups-map",
       "chart":"yellow-fairy-cups-chart",
       "gbif":"https://www.gbif.org/species/2584306"

   },
   {
       "id": 1052,
       "name": "Tinder Fungus",
       "scientificName": "Fomes fomentarius",
       "edible": "Not Edible",
       "gourmet": "Not Choice",
       "family": "Polyporaceae",
       "description": "Fomes fomentarius (commonly known as the tinder fungus, false tinder fungus, hoof fungus, tinder conk, tinder polypore or ice man fungus) is a species of fungal plant pathogen found in Europe, Asia, Africa and North America. The species produces very large polypore fruit bodies which are shaped like a horse's hoof and vary in colour from a silvery grey to almost black, though they are normally brown. It grows on the side of various species of tree, which it infects through broken bark, causing rot. The species typically continues to live on trees long after they have died, changing from a parasite to a decomposer.",
       "appearance": "Fomes fomentarius has a fruit body of between 5 and 45 centimetres (2.0 and 17.7 in) across, 3 and 25 cm (1.2 and 9.8 in) wide and 2 and 25 cm (0.8 and 9.8 in) thick, which attaches broadly to the tree on which the fungus is growing. While typically shaped like a horse's hoof, it can also be more bracket-like with an umbonate attachment to the substrate. The species typically has broad, concentric ridges, with a blunt and rounded margin. The flesh is hard and fibrous, and a cinnamon brown colour. The upper surface is tough, bumpy, hard and woody, varying in colour, usually a light brown or grey. The margin is whitish during periods of growth.",
       "imageName": "tinder-fungus1",
       "funFact": "The species' mycelium penetrates the wood of trees through damaged bark or broken branches, causing rot in the host. It can grow on the bark wound, or even directly onto the bark of older or dead trees.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Trees", "Dead Wood", ""],
       "image1": "https://en.wikipedia.org/wiki/Fomes_fomentarius#/media/File:Fomes_fomentarius_2010_G2.jpg",
       "image2": "https://en.wikipedia.org/wiki/Fomes_fomentarius#/media/File:Fomes_fomentarius_25616.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Fomes_fomentarius",
       "category":"inedible",
       "map":"tinder-fungus-map",
       "chart":"tinder-fungus-chart",
       "gbif":"https://www.gbif.org/species/2549323"

   }
   

]
