[
   {
       "id": 1001,
       "name": "Oyster Mushroom",
       "scientificName": "Pleurotus ostreatus",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Pleurotus ostreatus",
       "description": "Pleurotus ostreatus, the oyster mushroom or oyster fungus, is a common edible mushroom. It was first cultivated in Germany as a subsistence measure during World War I and is now grown commercially around the world for food. It is related to the similarly cultivated king oyster mushroom. Oyster mushrooms can also be used industrially for mycoremediation purposes. The oyster mushroom is one of the more commonly sought wild mushrooms, though it can also be cultivated on straw and other media. It has the bittersweet aroma of benzaldehyde (which is also characteristic of bitter almonds).",
       "appearance": "The mushroom has a broad, fan or oyster-shaped cap spanning 2–30 cm (3⁄4–11 3⁄4 in); natural specimens range from white to gray or tan to dark-brown; the margin is inrolled when young, and is smooth and often somewhat lobed or wavy. The flesh is white, firm, and varies in thickness due to stipe arrangement. The gills of the mushroom are white to cream, and descend on the stalk if present. If so, the stipe is off-center with a lateral attachment to wood. The spore print of the mushroom is white to lilac-gray, and best viewed on dark background. The mushroom's stipe is often absent. When present, it is short and thick.",
       "imageName": "oyster1",
       "funFact": "The oyster mushroom is one of the few known carnivorous mushrooms. Its mycelia can kill and digest nematodes, which is believed to be a way in which the mushroom obtains nitrogen.",
       "lookalikes": "none",
       "growable" : true,
       "locations" : ["Trees", "Dead Wood", "Cultivated"],
       "image1": "https://commons.wikimedia.org/wiki/File:Oyster_Mushroom_-_Pleurotus_ostreatus_(26433675278).jpg",
       "image2": "https://en.wikipedia.org/wiki/File:Pleurotus_ostreatus_JPG7.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Pleurotus_ostreatus",
       "category":"choice"

   },
   {
       "id": 1002,
       "name": "Shiitake Mushroom",
       "scientificName": "Lentinula edodes",
       "edible": "Edible",
       "gourmet": "Choice ",
       "family": "Marasmiaceae",
       "description": "The shiitake is an edible mushroom native to East Asia, which is cultivated and consumed in many East Asian countries. It is considered a medicinal mushroom in some forms of traditional medicine. Shiitake grow in groups on the decaying wood of deciduous trees, particularly shii and other chinquapins, chestnut, oak, maple, beech, sweetgum, poplar, hornbeam, ironwood, and mulberry. Its natural distribution includes warm and moist climates in Southeast Asia.",
       "appearance": "Shiitake mushrooms are small to medium in size with caps averaging 10-20 centimeters in diameter and are attached to thin stems. The caps range in color from light to dark brown and have a wide, umbrella shape with a characteristic curled rim. Inside, the cream-colored flesh is firm, chewy, and spongy.",
       "imageName": "shiitake1",
       "funFact": "In 2015, a study with 52 adults indicated that regular consumption of shiitake can result in improved immunity.",
       "lookalikes": "none",
       "growable" : true,
       "locations" : ["Wood", "Cultivated", ""],
       "image1": "https://en.wikipedia.org/wiki/File:Shiitakegrowing.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Shiitake_mushrooms_2.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Shiitake",
       "category":"choice"

   },
   {
       "id": 1003,
       "name": "Shrimp of the woods",
       "scientificName": "Entoloma abortivum",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Entolomataceae",
       "description": "Entoloma abortivum, commonly known as the aborted entoloma or shrimp of the woods, is an edible mushroom in the Entolomataceae family of fungi. Caution should be used in identifying the species before eating. First named Clitopilus abortivus by Miles Joseph Berkeley and Moses Ashley Curtis, it was given its current name by the Dutch mycologist Marinus Anton Donk in 1949.",
       "appearance": "Need data",
       "imageName": "shrimp1",
       "funFact": "It was believed that the honey mushroom, Armillaria mellea, was parasitizing the entoloma. But research has indicated that the inverse may be true—the entoloma may be parasitizing the honey mushroom. There is still some disagreement by mushroom collectors about this since it is common to see both the aborted and unaborted forms of the entoloma on wood and in leaf litter, whereas Armillaria generally only fruits on wood. Both versions of the entoloma have also been observed when there are no Armillaria fruiting.",
       "lookalikes": "none",
       "growable" : false,
       "locations" : ["", "", ""],
       "image1": "https://commons.wikimedia.org/wiki/File:2013-02-14_Entoloma_abortivum_(Berk._and_M.A._Curtis)_Donk_309718.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:2013-10-13_Entoloma_abortivum_(Berk._and_M.A._Curtis)_Donk_389693.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Entoloma_abortivum",
       "category":"choice"

   },
   {
       "id": 1004,
       "name": "Artist's Conk",
       "scientificName": "Ganoderma Applanatum",
       "edible": "Not Edible",
       "gourmet": "Not Choice",
       "family": "Ganodermataceae",
       "description": "Ganoderma applanatum is a wood-decay fungus, causing a rot of heartwood in a variety of trees. It can also grow as a pathogen of live sapwood, particularly on older trees that are sufficiently wet. It is a common cause of decay and death of beech and poplar, and less often of several other tree genera, including alder, apple, elm, buckeye and horse chestnut, maple, oak, walnut, willow, western hemlock, Douglas fir, old or sick olive tree and spruce. A peculiarity of this fungus lies in its use as a drawing medium for artists. When the fresh white pore surface is rubbed or scratched with a sharp implement, dark brown tissue under the pores is revealed, resulting in visible lines and shading that become permanent once the fungus is dried.",
       "appearance": "This fungus grows as a mycelium within the wood of living and dead trees. It forms fruiting bodies that are 3–30 cm wide × 5–50 cm long × 1–10 cm thick, hard as leather, woody-textured, and inedible. They are white at first but soon turn dark red-brown. Brown spores are released from the pores on the underside of the fruiting body. The tubes are 4-12 mm deep and terminate in pores that are round with 4-6 per millimetre. The fruiting bodies are perennial, and may persist for multiple years, increasing in size and forming new layers of pores as they grow.",
       "imageName": "artists-conk1",
       "funFact": "G. applanatum is a medicinal farming crop that is used as a flavor enhancer in Asian cuisine. G. applanatum is non-digestible in its raw form, but it is used for cooking, because of its rich mushroom flavor. Blending with filtration, or cold pressing in water, is a common method for creating ganoderma drinks. Hot herbal soups, or fermentation in lemon acid with onion is a common use for cooking with G. applanatum slices as an umami flavor enhancer in fermented foods.",
       "lookalikes": "The similar Ganoderma brownii has thicker, darker flesh, often a yellow pore surface, and larger basidiospores than G. applanatum",
       "growable" : false,
       "locations" : ["", "", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Ganoderma_applanatum",
       "category":"inedible"

   },
   {
       "id": 1005,
       "name": "Beech Mushroom",
       "scientificName": "Hypsizygus tessellatus",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Tricholomataceae",
       "description": "Buna shimeji (Hypsizygus tessellatus) is an edible mushroom native to East Asia. It is cultivated locally in temperate climates in Europe, North America and Australia and sold fresh in super markets. Two variations are known: Buna-shimeji (Brown Beech Mushroom), Bunapi-shimeji (White Beech Mushroom).",
       "appearance": "In nature, shimeji are gilled mushrooms that grow on wood. Most often the mushroom is found on beech trees, hence the common name, beech mushroom. They are often small and thin in appearance and popular in many nations across the world.",
       "imageName": "beech1",
       "funFact": "Being tough when raw, the Shimeji should be cooked, having a bitter taste when raw which disappears completely upon cooking. The cooked mushroom has a firm, slightly crunchy texture and a nutty flavor. Preparation makes the mushroom easier to digest. It is often eaten with stir-fried foods including wild game and seafood. It is used in soups, stews and sauces.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["", "", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Hypsizygus_tessellatus",
       "category":"edible"

   },
   {
       "id": 1006,
       "name": "Beefsteak Mushroom",
       "scientificName": "Fistulina hepatica",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Fistulinaceae",
       "description": "Fistulina hepatica (beefsteak fungus, also known as beefsteak polypore, ox tongue, or tongue mushroom) is an unusual bracket fungus classified in the Agaricales, that is commonly seen in Britain, but can be found in North America, Australia, North Africa, Southern Africa and the rest of Europe. As its name suggests, it looks remarkably similar to a slab of raw meat. It has been used as a meat substitute in the past, and can still be found in some French markets. It has a sour, slightly acidic taste. For eating it must be collected young and it may be tough and need long cooking.",
       "appearance": "The shape resembles a large tongue, and it is rough-surfaced with a reddish-brown colour. The spores are released from minute pores on the creamy-white underside of the fruit body. A younger Fistulina hepatica is a pinkish-red colour, and it darkens with age. It bleeds a dull red juice when cut, with the cut flesh further resembling meat. It is edible and considered choice.",
       "imageName": "beefsteak1",
       "funFact": "The species is fairly common, and can often be found on oaks and sweet chestnut, from August to the end of autumn, on either living or dead wood. It has a tendency to impart a reddish-brown stain to the living wood of oaks, creating a desirable timber type. In Australia, it can be found growing from wounds on Eucalyptus trees. It causes a brown rot on the trees which it infects.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["", "", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Fistulina_hepatica",
       "category":"choice"

   },
   {
       "id": 1007,
       "name": "Button Mushroom",
       "scientificName": "Agaricus bisporus",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Agaricaceae",
       "description": "Agaricus bisporus is an edible basidiomycete mushroom native to grasslands in Europe and North America. It has two color states while immature – white and brown – both of which have various names, with additional names for the mature state. A. bisporus is cultivated in more than seventy countries, and is one of the most commonly and widely consumed mushrooms in the world. This mushroom is commonly found worldwide in fields and grassy areas following rain, from late spring through to autumn, especially in association with manure. In many parts of the world it is widely collected and eaten; however, resemblance to deadly or poisonous lookalikes should be noted.",
       "appearance": "The pileus or cap of the original wild species is a pale grey-brown in color, with broad, flat scales on a paler background and fading toward the margins. It is first hemispherical in shape before flattening out with maturity, and 5–10 centimetres (2–4 inches) in diameter. The narrow, crowded gills are free and initially, pink, then red-brown and finally a dark brown with a whitish edge from the cheilocystidia.",
       "imageName": "button1",
       "funFact": "A. bisporus is now cultivated in at least seventy countries throughout the world. Global production in the early 1990s was reported to be more than 1.4 billion kilograms (1.5 million short tons), worth more than US$2 billion. In the U.S., the white button form of A. bisporus alone accounts for about 90% of mushrooms sold.",
       "lookalikes": "The common mushroom could be confused with young specimens of the deadly poisonous destroying angel (Amanita sp.), but the latter may be distinguished by their volva or cup at the base of the mushroom and pure white gills (as opposed to pinkish or brown of A. bisporus). Thus it is always important to clear away debris and examine the base of such similar mushrooms, as well as cutting open young specimens to check the gills. Furthermore, the destroying angel grows in mossy woods and lives symbiotically with spruce.A more common and less dangerous mistake is to confuse A. bisporus with Agaricus xanthodermus, an inedible mushroom found worldwide in grassy areas. A. xanthodermus has an odor reminiscent of phenol; its flesh turns yellow when bruised. This fungus causes nausea and vomiting in some people. The poisonous European species Entoloma sinuatum has a passing resemblance as well, but has yellowish gills, turning pink, and it lacks a ring.",
       "growable" : true,
       "locations" : ["", "", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Agaricus_bisporus",
       "category":"choice"

   },
   {
       "id": 1008,
       "name": "Cauliflower Mushroom",
       "scientificName": "Sparassis",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Sparassidaceae",
       "description": "Sparassis (also known as cauliflower mushroom) is a genus of parasitic and saprobic mushrooms characterised by their unique shape and appearance. This appearance can be described as similar to a sea sponge, a brain, or a head of cauliflower, from which it has been given its popular name. They are increasingly cultivated and being sold in Korea, Japan, United States and Australia. The generic name comes from the Greek sparassein meaning to tear.",
       "appearance": "Their color can range from light brown-yellow to yellow-grey or a creamy white cauliflower colour. They are normally 10 to 25 cm tall, but can grow to be quite large, with reported cases of fruiting bodies more than half a meter tall and 14 kg in weight. Because of their unique look and size, they are unlikely to be mistaken for any poisonous/inedible mushrooms. They grow as parasites or saprobes on the roots or bases of various species of hardwoods, especially oak, and conifers, and hence are most commonly found growing close to fir, pine, oak or spruce trees.",
       "imageName": "cauliflower1",
       "funFact": "Experiments suggest that S. crispa contains chemicals which may stimulate the immune system and have anti-tumor properties.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["", "", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Sparassis",
       "category":"edible"

   },
   {
       "id": 1009,
       "name": "Chanterelle Mushroom",
       "scientificName": "Cantharellus",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Cantharellaceae",
       "description": "Though records of chanterelles being eaten date back to the 16th century, they first gained widespread recognition as a culinary delicacy with the spreading influence of French cuisine in the 18th century, when they began appearing in palace kitchens. For many years, they remained notable for being served at the tables of nobility. Chanterelles as a group are generally described as being rich in flavor, with a distinctive taste and aroma difficult to characterize. Some species have a fruity odor, others a more woody, earthy fragrance, and still others can even be considered spicy. The golden chanterelle is perhaps the most sought-after and flavorful chanterelle, and many chefs consider it on the same short list of gourmet fungi as truffles and morels. It therefore tends to command a high price in both restaurants and specialty stores.",
       "appearance": "They are orange, yellow or white, meaty and funnel-shaped. On the lower surface, underneath the smooth cap, most species have rounded, forked folds[1] that run almost all the way down the stipe, which tapers down seamlessly from the cap. Many species emit a fruity aroma, reminiscent of apricots, and often have a mildly peppery taste (hence its German name, Pfefferling).",
       "imageName": "chanterelle1",
       "funFact": "They tend to grow in clusters in mossy coniferous forests, but are also often found in mountainous birch forests and among grasses and low-growing herbs.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["", "", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Chanterelle",
       "category":"choice"

   },
   {
       "id": 1010,
       "name": "Chicken of the Woods Mushroom",
       "scientificName": "Laetiporus sulphureus",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Polyporaceae",
       "description": "Laetiporus sulphureus is a species of bracket fungus (fungi that grow on trees) found in Europe and North America. Its common names are crab-of-the-woods, sulphur polypore, sulphur shelf, and chicken-of-the-woods. Its fruit bodies grow as striking golden-yellow shelf-like structures on tree trunks and branches. Old fruitbodies fade to pale beige or pale grey. The undersurface of the fruit body is made up of tubelike pores rather than gills. Laetiporus sulphureus is a saprophyte and occasionally a weak parasite, causing brown cubical rot in the heartwood of trees on which it grows. Unlike many bracket fungi, it is edible when young, although adverse reactions have been reported.",
       "appearance": "The fruiting body emerges directly from the trunk of a tree and is initially knob-shaped, but soon expands to fan-shaped shelves, typically growing in overlapping tiers. It is sulphur-yellow to bright orange in color and has a suedelike texture. Old fruitbodies fade to tan or whitish. Each shelf may be anywhere from 5 to 60 centimetres (2 to 23 1⁄2 inches) across and up to 4 cm (1 1⁄2 in) thick. The fertile surface is sulphur-yellow with small pores or tubes and produces a white spore print. When fresh, the flesh is succulent with a strong fungal aroma and exudes a yellowish, transparent juice, but soon becomes dry and brittle.",
       "imageName": "chicken-of-the-woods1",
       "funFact": "Many people think that the mushroom tastes like crab or lobster leading to the nickname lobster-of-the-woods. It is highly regarded in Germany and North America.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["", "", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Laetiporus_sulphureus",
       "category":"choice"

   },
   {
       "id": 1011,
       "name": "Corn Smut",
       "scientificName": "Ustilago maydis",
       "edible": "Use Caution",
       "gourmet": "Not Choice",
       "family": "Ustilaginaceae",
       "description": "Corn smut is a plant disease caused by the pathogenic fungus Ustilago maydis that causes smut on maize and teosinte. The fungus forms galls on all above-ground parts of corn species. It is edible, and is known in Mexico as the delicacy huitlacoche; which is eaten, usually as a filling, in quesadillas and other tortilla-based foods, and in soups.",
       "appearance": "The fungus infects all parts of the host plant by invading the ovaries of its host. The infection causes the corn kernels to swell up into tumor-like galls, whose tissues, texture, and developmental pattern are mushroom-like. These galls are made up of hypertrophied cells of the infected plant, along with resulting fungal threads, and blue-black spores. These dark-colored spores give the cob a burned, scorched appearance; this is the origin of the generic name Ustilago, from the Latin word ustilare (to burn).",
       "imageName": "corn-smut2",
       "funFact": "Corn smut, while a delicacy across the world, can also have economical repercussions. Aydogdu and Boyraz found that corn exposed to corn smut resulted in a 33% yield loss. With corn being a staple crop for both animals and people, a 33% yield loss could prove disastrous to food supply. However, out of the many types of corn, sweet corn is the most affected by corn smut.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["", "", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Corn_smut",
       "category":"use caution"

   },
   {
       "id": 1012,
       "name": "Cordyceps",
       "scientificName": "Cordyceps militaris",
       "edible": "Use Caution",
       "gourmet": "Not Choice",
       "family": "Cordycipitaceae",
       "description": "Cordyceps militaris is a species of fungus in the family Cordycipitaceae, and the type species of the genus Cordyceps. It was originally described by Carl Linnaeus in 1753 as Clavaria militaris. It is a potential harbour of bio-metabolites for herbal drugs and evidences are available about its applications for revitalization of various systems of the body from ancient times. C. militaris can be cultivated in a variety of media including silkworm pupae, rice, or liquid nutrition. It is considered inedible in American sources, but in Asia the fruiting body is cooked as a mushroom in dishes like chicken soup.",
       "appearance": "The fungus forms 20–50 mm high, club-shaped and orange/red fruiting bodies, which grow out of dead underground pupae. The club is covered with the stroma, into which the actual fruit bodies, the perithecia, are inserted. The surface appears roughly punctured. The inner fungal tissue is whitish to pale orange.",
       "imageName": "cordyceps1",
       "funFact": "Cordyceps militaris is a entomopathogenic fungus, meaning it parasitizes insects. Many authors consider it quite common, spread throughout the northern hemisphere, and fruiting bodies appear in Europe from August to November.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["", "", ""],
       "image1": "",
       "image2": "",
       "wiki": "https://en.wikipedia.org/wiki/Cordyceps_militaris",
       "category":"use caution"

   },
   {
       "id": 1013,
       "name": "Enoki",
       "scientificName": "Flammulina velutipes",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Physalacriaceae",
       "description": "Enoki (Flammulina velutipes), also known as velvet shank, is a species of edible mushroom in the family Physalacriaceae. It is well-known for its role in Japanese cuisine, where it is also known as enokitake. There is a significant difference in appearance between the wild and cultivated types of the mushroom. Cultivated mushrooms have not been exposed to light, resulting in a white color, whereas wild mushrooms usually display a dark brown color. Cultivated mushrooms are grown in a carbon dioxide (CO2)-rich environment to nurture the development of long thin stems, whereas wild mushrooms produce a much shorter and thicker stem.",
       "appearance": "The mushroom naturally grows on the stumps of the Chinese hackberry tree (Celtis sinensis) and on other trees, such as ash, mulberry and persimmon trees. Enoki can be sourced September- March and has been named winter fungus due to its seasonality. Wild forms differ in color, texture, and sliminess and may be called futu, seafood mushrooms, winter mushrooms or winter fungus, velvet foot, velvet stem or velvet shank.",
       "imageName": "enoki1",
       "funFact": "Commercially farmed enoki is a long, thin white mushroom and is a popular ingredient for soups, especially in East Asian cuisine, but can be used for salads and other dishes. The mushroom has a crisp texture and can be refrigerated for approximately one week. This shape is due to a CO2-rich atmosphere used in farming. The farmed form is also known as golden needle mushroom, futu mushroom or lily mushroom. The farmed F. velutipes is sold both fresh and canned.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Trees", "Cultivated", ""],
       "image1": "https://en.wikipedia.org/wiki/File:Flammulina_velutipes.JPG",
       "image2": "https://en.wikipedia.org/wiki/File:EnokitakeJapaneseMushroom.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Cordyceps_militaris",
       "category":"choice"

   },
   {
       "id": 1014,
       "name": "Fly Agaric",
       "scientificName": "Amanita muscaria",
       "edible": "Poisonous",
       "gourmet": "Not Choice",
       "family": "Physalacriaceae",
       "description": "Amanita muscaria, commonly known as the fly agaric or fly amanita, is a basidiomycete of the genus Amanita. It is also a muscimol mushroom. Native throughout the temperate and boreal regions of the Northern Hemisphere, Amanita muscaria has been unintentionally introduced to many countries in the Southern Hemisphere, generally as a symbiont with pine and birch plantations, and is now a true cosmopolitan species. It associates with various deciduous and coniferous trees.",
       "appearance": "Arguably the most iconic toadstool species, the fly agaric is a large white-gilled, white-spotted, usually red mushroom, and is one of the most recognizable and widely encountered in popular culture. Despite its easily distinguishable features, Amanita muscaria is a fungus with several known variations, or subspecies. These subspecies are slightly different, some have yellow or white caps, but they are all usually called fly agarics, and they are most of the time recognizable by their notable white spots.",
       "imageName": "fly-agaric1",
       "funFact": "Although classified as poisonous, reports of human deaths resulting from A. muscaria ingestion are extremely rare. After parboiling twice with water draining—which weakens its toxicity and breaks down the mushroom's psychoactive substances—it is eaten in parts of Europe, Asia, and North America. All Amanita muscaria varieties, but in particular A. muscaria var. muscaria, are noted for their hallucinogenic properties, with the main psychoactive constituents being the neurotoxins ibotenic acid and muscimol.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/Amanita_muscaria#/media/File:2006-10-25_Amanita_muscaria_crop.jpg",
       "image2": "https://en.wikipedia.org/wiki/Amanita_muscaria#/media/File:Amanita_muscaria_var._formosa_sensu_Thiers.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Amanita_muscaria",
       "category":"poisonous"

   },
   {
       "id": 1015,
       "name": "Giraffe Spots",
       "scientificName": "Peniophora albobadia",
       "edible": "Not Edible",
       "gourmet": "Not Choice",
       "family": "Peniophoraceae",
       "description": "Peniophora albobadia is a species of crust fungus in the family Peniophoraceae. It is a plant pathogen that affects stone fruits. First described scientifically by Lewis David de Schweinitz in 1822, it was transferred to the genus Peniophora by Jacques Boidin in 1961. It is most commonly found in the United States",
       "appearance": "Need data!",
       "imageName": "giraffe-spots1",
       "funFact": "Need data!",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/File:Peniophora_albobadia_196080.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Peniophora_albobadia_6.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Peniophora_albobadia",
       "category":"inedible"

   },
   {
       "id": 1016,
       "name": "Giant Puffball",
       "scientificName": "Calvatia gigantea",
       "edible": "Use Caution",
       "gourmet": "Not Choice",
       "family": "Agaricaceae",
       "description": "Calvatia gigantea, commonly known as the giant puffball, is a puffball mushroom commonly found in meadows, fields, and deciduous forests usually in late summer and autumn. It is found in temperate areas throughout the world.",
       "appearance": "Most giant puffballs grow to be 10 to 50 centimetres (4 to 20 inches), sometimes to be 90 cm (35 in) in diameter; although occasionally some can reach diameters up to 150 cm (60 in) and weights of 20 kg (44 lb). The inside of mature Giant puffballs is greenish brown, whereas the interior of immature puffballs is white. The large white mushrooms are edible when young.",
       "imageName": "giant-puffball1",
       "funFact": "The fruiting body of a puffball mushroom will develop within the period of a few weeks and soon begin to decompose and rot, at which point it is dangerous to eat. Unlike most mushrooms, all the spores of the giant puffball are created inside the fruiting body; large specimens can easily contain several trillion spores.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", "Rotting Wood"],
       "image1": "https://en.wikipedia.org/wiki/Calvatia_gigantea#/media/File:Giant_Puffball_Lemoine_Point.jpg",
       "image2": "https://en.wikipedia.org/wiki/Calvatia_gigantea#/media/File:Calvatia_gigantea.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Calvatia_gigantea",
       "category":"use caution"

   },
   {
       "id": 1017,
       "name": "Green-spored Lepiota",
       "scientificName": "Chlorophyllum molybdites",
       "edible": "Poisonous",
       "gourmet": "Not Choice",
       "family": "Agaricaceae",
       "description": "Chlorophyllum molybdites, which has the common names of false parasol, green-spored Lepiota and vomiter, is a widespread mushroom. Poisonous and producing severe gastrointestinal symptoms of vomiting and diarrhea, it is commonly confused with the shaggy parasol or shaggy mane, and is the most commonly consumed poisonous mushroom in North America. Its large size and similarity to the edible parasol mushroom, as well as its habit of growing in areas near human habitation, are reasons cited for this. The nature of the poisoning is predominantly gastrointestinal.",
       "appearance": "It is an imposing mushroom with a pileus (cap) up to 40 cm in diameter, hemispherical and with a flattened top. The cap is whitish in colour with coarse brownish scales. The gills are free and white, usually turning dark and green with maturity. It has a rare green spore print. The tall stipe may be up to 25 cm tall and bears a ring. This mushroom lacks the snakeskin pattern that is generally present on the parasol mushroom. Chlorophyllum molybdites grows in lawns and parks across eastern North America and California, as well as temperate and subtropical regions around the world. Fruiting bodies generally appear after summer and autumn rains.",
       "imageName": "lepiota1",
       "funFact": "Chlorophyllum molybdites is the most frequently eaten poisonous mushroom in North America. The symptoms are predominantly gastrointestinal in nature, with vomiting, diarrhea and colic, often severe, occurring 1–3 hours after consumption. Although these poisonings can be severe, none has yet resulted in death.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", "Rotting Wood"],
       "image1": "https://en.wikipedia.org/wiki/Chlorophyllum_molybdites#/media/File:Chlorophyllum_molybdites_Guadalajara.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Chlorophyllum_molybdites.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Chlorophyllum_molybdites",
       "category":"poisonous"

   },
   {
       "id": 1018,
       "name": "Shingled Hedgehog",
       "scientificName": "Sarcodon imbricatus",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Bankeraceae",
       "description": "Sarcodon imbricatus, commonly known as the shingled hedgehog or scaly hedgehog, is a species of tooth fungus in the order Thelephorales. The mushroom is edible. Many sources report it has a bitter taste, but others have found it delicious and suspect that the bitter specimens may be similar related species. The mushroom has a large, brownish cap with large brown scales and may reach 30 cm (12 in) in diameter. On the underside it sports greyish, brittle teeth instead of gills, and has white flesh. Its spore print is brown. It is associated with spruce (Picea), appearing in autumn. It ranges throughout North America and Europe, although collections from the British Isles are now assigned to the similar species Sarcodon squamosus.",
       "appearance": "The mushrooms, or fruiting bodies, can be quite large in size. the brownish or greyish cap measures up to 30 cm (12 in) in diameter and is covered with coarse darker brown scales. It is funnel-shaped. The underside bears soft, pale grey 'teeth' rather than gills. These are 0.5–1 cm long and brittle. The pale grey or brown stipe may reach 8 centimetres (3.1 in) high and 3 centimetres (1.2 in) wide, and may be narrower at the base and is sometimes eccentric.",
       "imageName": "shingled-hedgehog1",
       "funFact": "The fungus can be bitter, although this is less apparent in younger specimens. Submerging the mushrooms in boiling water will remove this. It can be pickled or dried and used as flavouring. In Bulgaria it is collected, dried and finely ground to be used as an aromatic mushroom flour. It is reported as edible but of poor quality in the United States by some sources but as deliciously edible by others.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "Rotting Wood", ""],
       "image1": "https://en.wikipedia.org/wiki/Sarcodon_imbricatus#/media/File:Habichtspilz-Sarcodon-imbricatus.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Sarcodon_imbricatus_T64.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Sarcodon_imbricatus",
       "category":"edible"

   },
   {
       "id": 1019,
       "name": "Sweet Tooth",
       "scientificName": "Hydnum repandum",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Hydnaceae",
       "description": "Hydnum repandum, commonly known as the sweet tooth, wood hedgehog or hedgehog mushroom, is a basidiomycete fungus of the family Hydnaceae. First described by Carl Linnaeus in 1753, it is the type species of the genus Hydnum. A mycorrhizal fungus, Hydnum repandum is broadly distributed in Europe where it fruits singly or in close groups in coniferous or deciduous woodland. This is a choice edible species, although mature specimens can develop a bitter taste. It has no poisonous lookalikes. Mushrooms are collected and sold in local markets of Europe and Canada.",
       "appearance": "The fungus produces fruit bodies (mushrooms) that are characterized by their spore-bearing structures—in the form of spines rather than gills—which hang down from the underside of the cap. The cap is dry, colored yellow to light orange to brown, and often develops an irregular shape, especially when it has grown closely crowded with adjacent fruit bodies. The mushroom tissue is white with a pleasant odor and a spicy or bitter taste. All parts of the mushroom stain orange with age or when bruised.",
       "imageName": "sweet-tooth1",
       "funFact": "Hydnum repandum is frequently sold with chanterelles in Italy, and in France, it is one of the officially recognized edible species sold in markets. In Europe, it is usually sold under its French name pied-de-mouton (sheep's foot). It is also collected and sold in local markets of Mexico, Spain and British Columbia, Canada. H. repandum mushrooms are also used as a food source by the red squirrel.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "Rotting Wood", "Grass"],
       "image1": "https://en.wikipedia.org/wiki/Hydnum_repandum#/media/File:Hedgehog_fungi2.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Semmel-Stoppelpilz_Semmelgelber_Stacheling_Hydnum_repandum.JPG",
       "wiki": "https://en.wikipedia.org/wiki/Hydnum_repandum#Ecology,_habitat_and_distribution",
       "category":"choice"

   },
   {
       "id": 1020,
       "name": "Horn of Plenty",
       "scientificName": "Craterellus cornucopioides",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Cantharellaceae",
       "description": "Craterellus cornucopioides, or horn of plenty, is an edible mushroom. It is also known as the black chanterelle, black trumpet, trompette de la mort (French), trombetta dei morti (Italian) or trumpet of the dead. This fungus is found in woods in Europe, North America, Japan and Korea. Mainly it grows under beech, oak or other broad-leaved trees, especially in moss in moist spots on heavy calcareous soil. In Europe it is generally common but seems to be rare in some countries such as the Netherlands. It appears from June to November, and in the UK, from August to November. The mushroom is usually almost black, and it is hard to find because its dark colour easily blends in with the leaf litter on the forest floor. Hunters of this mushroom say it is like looking for black holes in the ground.",
       "appearance": "The fruiting body does not have a separation into stalk and cap, but is shaped like a funnel expanded at the top, normally up to about 10 centimetres (4 inches) tall and 7 cm (3 in) in diameter (but said to grow exceptionally to 15 cm or 6 in). The upper and inner surface is black or dark grey, and the lower and outer fertile surface is a much lighter shade of grey. The fertile surface is more or less smooth but may be somewhat wrinkled.",
       "imageName": "horn-of-plenty1",
       "funFact": "A possible origin for the name 'trumpet of the dead' is that the growing mushrooms were seen as being played as trumpets by dead people under the ground.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "Grass", ""],
       "image1": "https://en.wikipedia.org/wiki/Craterellus_cornucopioides#/media/File:2010-08-24_Craterellus_cinereus_(Pers.)_Qu%C3%A9l_100703_cropped.jpg",
       "image2": "https://en.wikipedia.org/wiki/Craterellus_cornucopioides#/media/File:Craterellus_cornucopioides_JPG1.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Craterellus_cornucopioides",
       "category":"choice"

   },
   {
       "id": 1021,
       "name": "Jack-o'-lantern Mushroom",
       "scientificName": "Omphalotus olearius",
       "edible": "Poisonous",
       "gourmet": "Not Choice",
       "family": "Marasmiaceae",
       "description": "Omphalotus olearius, commonly known as the jack-o'-lantern mushroom, is a poisonous orange gilled mushroom that to an untrained eye appears similar to some chanterelles. It is notable for its bioluminescent properties. It is found in woodland areas in Europe, where it grows on decaying stumps, on buried roots or at the base of hardwood trees. It has also been reported from the Western Cape Province, South Africa. A similar, but phylogenetically distinct species found in eastern North America is Omphalotus illudens.",
       "appearance": "The jack-o'-lantern mushroom is orange. Its bioluminescence, a blue-green color, can be observed in fresh specimens in low light conditions once the eye becomes dark-adapted. The whole mushroom does not glow—only the gills do so. This is due to an enzyme called luciferase, acting upon a compound called luciferin, leading to the emission of light much as fireflies do when glowing.",
       "imageName": "jack-o-lantern1",
       "funFact": "While not lethal, consuming this mushroom leads to very severe cramps, vomiting, and diarrhea.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "Grass", "Wood"],
       "image1": "https://en.wikipedia.org/wiki/Omphalotus_olearius#/media/File:Omphalotus_olearius100.jpg",
       "image2": "https://en.wikipedia.org/wiki/Omphalotus_olearius#/media/File:Omphalotus_olearius.JPG",
       "wiki": "https://en.wikipedia.org/wiki/Omphalotus_olearius",
       "category":"poisonous"

   },
   {
       "id": 1022,
       "name": "King Oyster Mushroom",
       "scientificName": "Pleurotus eryngii",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Pleurotaceae",
       "description": "Pleurotus eryngii (also known as king trumpet mushroom, French horn mushroom, king oyster mushroom, king brown mushroom, boletus of the steppes, trumpet royale, aliʻi oyster) is an edible mushroom native to Mediterranean regions of Europe, the Middle East, and North Africa, but also grown in many parts of Asia. The mushroom has a good shelf life and is cultivated widely. It has little flavor or aroma when raw. When cooked, it develops rich umami flavor and a meaty texture.",
       "appearance": "P. eryngii is the largest species in the oyster mushroom genus, Pleurotus, which also contains the oyster mushroom Pleurotus ostreatus. It has a thick, meaty white stem and a small tan cap (in young specimens). Its natural range extends from the Atlantic Ocean through the Mediterranean Basin and Central Europe into Western Asia and India. Unlike other species of Pleurotus, which are primarily wood-decay fungi, the P. eryngii complex are also weak parasites on the roots of herbaceous plants, although they may also be cultured on organic wastes.",
       "imageName": "king-oyster1",
       "funFact": "Pleurotus eryngii may contain chemicals that stimulate the immune system. Dietary intake of Pleurotus eryngii may function as cholesterol-lowering dietary agent.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Forest Floor", "Wood", "Cultivated"],
       "image1": "https://commons.wikimedia.org/wiki/File:Kr%C3%A4uter-Seitling_Pleurotus_eryngii.jpg",
       "image2": "https://en.wikipedia.org/wiki/Pleurotus_eryngii#/media/File:Pleurotus_eryngii.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Pleurotus_eryngii",
       "category":"choice"

   },
   {
       "id": 1023,
       "name": "Lobster Mushroom",
       "scientificName": "Hypomyces lactifluorum",
       "edible": "Use Caution",
       "gourmet": "Not Choice",
       "family": "Hypocreaceae",
       "description": "The Lobster mushroom, Hypomyces lactifluorum, contrary to its common name, is not a mushroom, but rather a parasitic ascomycete fungus that grows on certain species of mushrooms, turning them a reddish orange color that resembles the outer shell of a cooked lobster. Lobster mushrooms are widely eaten and enjoyed fresh. They are commercially marketed and sometimes found in grocery stores; they have been made available at markets in Oregon. They have a seafood-like flavor and a firm, dense texture.",
       "appearance": "H. lactifluorum specifically attacks members of the genera Lactarius and Lactifluus (milk-caps), and Russula (brittlegills), such as Russula brevipes and Lactifluus piperatus in North America. At maturity, H. lactifluorum thoroughly covers its host, rendering it unidentifiable.",
       "imageName": "lobster1",
       "funFact": "While edible, field guides note the hypothetical possibility that H. lactifluorum could parasitize a toxic host and that individuals should avoid consuming lobster mushrooms with unknown hosts, although no instances of toxicity have been recorded.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Forest Floor", "Wood", "Cultivated"],
       "image1": "https://en.wikipedia.org/wiki/Hypomyces_lactifluorum#/media/File:Lobster_mushrooms.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Lobster_Mushroom_2.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Hypomyces_lactifluorum",
       "category":"use caution"

   },
   {
       "id": 1024,
       "name": "Hen of the Woods",
       "scientificName": "Grifola frondosa",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Meripilaceae",
       "description": "Grifola frondosa is a polypore mushroom that grows at the base of trees, particularly oaks. Also known as hen-of-the-woods, maitake (舞茸, 'dancing mushroom'), ram's head or sheep's head. It is typically found in late summer to early autumn. It is native to China, Europe, and North America. Like the sulphur shelf mushroom, G. frondosa is a perennial fungus that often grows in the same place for a number of years in succession. It occurs most prolifically in the northeastern regions of the United States, but has been found as far west as Idaho.",
       "appearance": "G. frondosa grows from an underground tuber-like structure known as a sclerotium, about the size of a potato. The fruiting body, occurring as large as 100 centimetres (40 inches), rarely 150 cm (60 in), is a cluster consisting of multiple grayish-brown caps which are often curled or spoon-shaped, with wavy margins and 2–10 cm (1–4 in) broad. The undersurface of each cap bears about one to three pores per millimeter, with the tubes rarely deeper than 3 mm (1⁄8 in). The milky-white stipe (stalk) has a branchy structure and becomes tough as the mushroom matures.",
       "imageName": "woods1",
       "funFact": "In Japan, the maitake can grow to more than 45 kilograms (100 pounds), earning this giant mushroom the title 'king of mushrooms'.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Forest Floor", "Wood", "Cultivated"],
       "image1": "https://en.wikipedia.org/wiki/Hypomyces_lactifluorum#/media/File:Lobster_mushrooms.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Hen_of_the_Woods_(Grifola_frondosa)_(5169557976).jpg",
       "wiki": "https://en.wikipedia.org/wiki/Grifola_frondosa",
       "category":"choice"

   },
   {
       "id": 1025,
       "name": "Milk Caps",
       "scientificName": "Lactarius",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Russulaceae",
       "description": "Lactarius is a genus of mushroom-producing, ectomycorrhizal fungi, containing several edible species. The species of the genus, commonly known as milk-caps, are characterized by the milky fluid ('latex') they exude when cut or damaged. Like the closely related genus Russula, their flesh has a distinctive brittle consistency. It is a large genus with over 500 known species,[1] mainly distributed in the Northern hemisphere. Recently, the genus Lactifluus has been separated from Lactarius based on molecular phylogenetic evidence.",
       "appearance": "Distinguishing Lactarius from Lactifluus based on morphology alone is difficult; there are no synapomorphic characters known so far that define both genera unequivocally but tendencies exist. Characters important for identification of milk-caps (Lactarius and Lactifluus) are: initial colour of the latex and color change, texture of cap surface, taste (mild, peppery, or bitter) of latex and flesh, odor, and microscopical features of the spores and the cap curticle (pileipellis). The habitat and especially the type of host tree can also be critical. While there are some easily recognizable species, other species can be quite hard to determine without microscopical examination.",
       "imageName": "milk-caps1",
       "funFact": "Several Lactarius species are edible. L. deliciosus notably ranks among the most highly valued mushrooms in the Northern hemisphere, while opinions vary on the taste of other species, such as L. indigo or L. deterrimus. Several species are reported to be regularly collected for food in Russia, Tanzania and Hunan, China. Some Lactarius are considered toxic, for example L. turpis, which contains a mutagenic compound, or L. helvus. There are, however, no deadly poisonous mushrooms in the genus.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Lactarius#/media/File:Lactarius_vietus041031w.jpg",
       "image2": "https://en.wikipedia.org/wiki/Lactarius#/media/File:Lactarius_pyrogallus.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Lactarius",
       "category":"use caution"

   },
   {
       "id": 1026,
       "name": "Pine Mushroom",
       "scientificName": "Tricholoma matsutake",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Tricholomataceae",
       "description": "Matsutake (Japanese: 松茸), Tricholoma matsutake, is a highly sought species of choice edible mycorrhizal mushroom that grows in Asia, Europe, and North America. It is prized in Japanese, Korean, and Chinese cuisines for its distinct spicy-aromatic odor. ",
       "appearance": "Matsutake mushrooms grow under trees and are usually concealed under litter on the forest floor, forming a symbiotic relationship with roots of various tree species. Matsutake mushrooms grow in eastern Asia in China, Japan, Korea, Bhutan and Laos; in Europe, in Estonia, Finland, Norway, Poland and Sweden; and on the Pacific coasts of Canada and the United States.",
       "imageName": "pine-mushroom1",
       "funFact": "Domestic production of matsutake in Japan has been sharply reduced over the last 50 years due to the pine-killing nematode Bursaphelenchus xylophilus, which has influenced the price a great deal. The price for matsutake in the Japanese market is highly dependent on quality, availability, and origin. The Japanese matsutake at the beginning of the season, which is the highest grade, can go up to $1,000 per kilogram.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Forest Floor", "", ""],
       "image1": "https://en.wikipedia.org/wiki/Matsutake#/media/File:Matsutake.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:Tricholoma_matsutake_(9627995451).jpg",
       "wiki": "https://en.wikipedia.org/wiki/Matsutake",
       "category":"choice"

   },
   {
       "id": 1027,
       "name": "Meadow Mushroom",
       "scientificName": "Agaricus campestris",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Agaricaceae",
       "description": "Agaricus campestris is a widely eaten gilled mushroom closely related to the cultivated button mushroom Agaricus bisporus. It is commonly known as the field mushroom or, in North America, meadow mushroom. Agaricus campestris is found in fields and grassy areas after rain from late summer onwards worldwide. It is often found on lawns in suburban areas. Appearing in small groups, in fairy rings, or solitary. Owing to the demise of horse-drawn vehicles, and the subsequent decrease in the number of horses on pasture, the old 'white outs' of years gone by are becoming rare events. This species is rarely found in woodland.",
       "appearance": "The cap is white, may have fine scales, and is 5 to 10 centimetres (2.0 to 3.9 in) in diameter; it is first hemispherical in shape before flattening out with maturity. The gills are initially pink, then red-brown and finally a dark brown, as is the spore print. The 3 to 10 centimetres (1.2 to 3.9 in) tall stipe is predominantly white and bears a single thin ring. The taste is mild. The white flesh bruises a dingy reddish brown, as opposed to yellow in the inedible (and somewhat toxic) Agaricus xanthodermus and similar species. The thick-walled, elliptical spores measure 5.5–8.0 μm by 4–5 μm. Cheilocystidia are absent.",
       "imageName": "meadow-mushroom1",
       "funFact": "Several species may be confused with Agaricus campestris. The most dangerous confusion may be with Amanita virosa, which is morbidly toxic, or with the deadly Amanita hygroscopica or 'Pink-Gilled Destroying Angel'.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/Agaricus_campestris#/media/File:Agaricus_campestris.jpg",
       "image2": "https://commons.wikimedia.org/wiki/File:2012-02-13_Agaricus_campestris_L_199587.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Agaricus_campestris",
       "category":"choice"

   },
   {
       "id": 1028,
       "name": "Morel Mushroom",
       "scientificName": "Morchella",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Morchellaceae",
       "description": "Morchella, the true morels, is a genus of edible sac fungi closely related to anatomically simpler cup fungi in the order Pezizales (division Ascomycota). These distinctive fungi have a honeycomb appearance due to the network of ridges with pits composing their caps. Morels are prized by gourmet cooks, particularly in French cuisine. Due to difficulties in cultivation, commercial harvesting of wild morels has become a multimillion-dollar industry in the temperate Northern Hemisphere, in particular North America, Turkey, China, the Himalayas, India, and Pakistan and Kashmir where these highly prized fungi are found in abundance.",
       "appearance": "The fruit bodies of Morchella species are highly polymorphic, varying in shape, color and size, while in many cases they do not exhibit clear-cut distinguishing features microscopically; this has historically contributed to uncertainties in taxonomy. Discriminating between the various taxa described, is further hindered by uncertainty over which of these are truly biologically distinct. Remarkably, some authors in the past had suggested that the genus contains as few as 3 to 6 species, while others recognised as many as 34. Many species appear to form symbiotic or endophytic relationships with trees, while others appear to act as saprotrophs. Yellow morels (Morchella esculenta and related species) are more commonly found under deciduous trees rather than conifers, while black morels (Morchella elata and related species) are mostly found in coniferous forests, disturbed ground and recently burned areas. Morchella galilaea, and occasionally Morchella rufobrunnea, appear to fruit in the autumn or winter months rather than spring, which is the typical fruiting season for morels.",
       "imageName": "morel1",
       "funFact": "Certain Morchella species (M. eximia, M. importuna, M. tomentosa and others) exhibit a pyrophilic behaviour and may grow abundantly in forests which have been recently burned by a fire. Moderate-intensity fires are reported to produce higher abundances of morels than low- or high-intensity fires. This is caused by the soil becoming more alkaline as the result of wood ash combining with water and being absorbed into the soil which triggers the morels to fruit.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/Morchella#/media/File:White_Morel_IMG_0399.JPG",
       "image2": "https://commons.wikimedia.org/wiki/File:Morchella_esculenta_84915.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Morchella",
       "category":"choice"

   },
   {
       "id": 1029,
       "name": "Pig's Ears",
       "scientificName": "Gomphus clavatus",
       "edible": "Use Caution",
       "gourmet": "Not Choice",
       "family": "Gomphaceae",
       "description": "Gomphus clavatus, commonly known as pig's ears or the violet chanterelle, is an edible species of fungus in the genus Gomphus native to Eurasia and North America. Described by Jacob Christian Schäffer in 1774, G. clavatus has had several name changes and many alternative scientific names, having been classified in the genus Cantharellus (also called chanterelles), though it is not closely related to them. Typically found in coniferous forests, G. clavatus is mycorrhizal, and is associated with tree species in a variety of coniferous genera, particularly spruces and firs. It is more common at elevations of greater than 2,000 ft (600 m), in moist, shady areas with plenty of leaf litter. ",
       "appearance": "The fruit body is vase- or fan-shaped with wavy edges to its rim, and grows up to 15–16 cm (6–6 1⁄4 in) wide and 17 cm (6 3⁄4 in) tall. The upper surface or cap is orangish-brown to lilac, while the lower spore-bearing surface, the hymenium, is covered in wrinkles and ridges rather than gills or pores, and is a distinctive purple color.",
       "imageName": "pigs-ears1",
       "funFact": "In Europe, Gomphus clavatus appears on the national Red Lists of threatened fungi in 17 countries and is one of 33 species of fungi proposed for international conservation under the Bern Convention.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", "Dead Wood"],
       "image1": "https://en.wikipedia.org/wiki/Gomphus_clavatus#/media/File:Gomphus_clavatus_II_Totes_Gebirge.jpg",
       "image2": "https://en.wikipedia.org/wiki/Gomphus_clavatus#/media/File:Gomphus_clavatus_Fairy_ring.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Gomphus_clavatus",
       "category":"use caution"

   },
   {
       "id": 1030,
       "name": "Porcini",
       "scientificName": "Boletus edulis",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Boletaceae",
       "description": "Boletus edulis (English: cep, penny bun, porcino or porcini) is a basidiomycete fungus, and the type species of the genus Boletus. Widely distributed in the Northern Hemisphere across Europe, Asia, and North America, it does not occur naturally in the Southern Hemisphere, although it has been introduced to southern Africa, Australia, New Zealand, and Brazil. Several closely related European mushrooms formerly thought to be varieties or forms of B. edulis have been shown using molecular phylogenetic analysis to be distinct species, and others previously classed as separate species are conspecific with this species. The western North American species commonly known as the California king bolete (Boletus edulis var. grandedulis) is a large, darker-coloured variant first formally identified in 2007.",
       "appearance": "The fungus grows in deciduous and coniferous forests and tree plantations, forming symbiotic ectomycorrhizal associations with living trees by enveloping the tree's underground roots with sheaths of fungal tissue. The fungus produces spore-bearing fruit bodies above ground in summer and autumn. The fruit body has a large brown cap which on occasion can reach 35 cm (14 in) in diameter and 3 kg (6 lb 10 oz) in weight. Like other boletes, it has tubes extending downward from the underside of the cap, rather than gills; spores escape at maturity through the tube openings, or pores. The pore surface of the B. edulis fruit body is whitish when young, but ages to a greenish-yellow. The stout stipe, or stem, is white or yellowish in colour, up to 25 cm (10 in) tall and 10 cm (4 in) thick, and partially covered with a raised network pattern, or reticulations.",
       "imageName": "porcini1",
       "funFact": "Prized as an ingredient in various culinary dishes, B. edulis is an edible mushroom held in high regard in many cuisines, and is commonly prepared and eaten in soups, pasta, or risotto. The mushroom is low in fat and digestible carbohydrates, and high in protein, vitamins, minerals and dietary fibre. Although it is sold commercially, it is very difficult to cultivate.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/Boletus_edulis#/media/File:Boletus_edulis_EtgHollande_041031_091.jpg",
       "image2": "https://en.wikipedia.org/wiki/Boletus_edulis#/media/File:Boletus_edulis_var._grandedulis_27911.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Boletus_edulis",
       "category":"choice"

   },
   {
       "id": 1031,
       "name": "Reishi",
       "scientificName": "Ganoderma lingzhi",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Ganodermataceae",
       "description": "Lingzhi, Ganoderma lingzhi, also known as reishi, is a polypore fungus ('bracket fungus') belonging to the genus Ganoderma. The lingzhi mushroom is used in traditional Chinese medicine. There is insufficient evidence that consuming lingzhi mushrooms or their extracts has an effect on cancer, metabolic diseases or cardiovascular diseases. In nature, it grows at the base and stumps of deciduous trees, especially that of the maple. Only two or three out of 10,000 such aged trees will have lingzhi growth, and therefore its wild form is rare. Lingzhi may be cultivated on hardwood logs, sawdust or woodchips.",
       "appearance": "Its red-varnished, kidney-shaped cap and peripherally inserted stem gives it a distinct fan-like appearance. When fresh, the lingzhi is soft, cork-like, and flat. It lacks gills on its underside, and instead releases its spores via fine pores. Depending on the age, the pores on its underside may be white or brown.",
       "imageName": "reishi1",
       "funFact": "Lingzhi, also known as reishi, is the ancient 'mushroom of immortality', revered for over 2,000 years. Uncertainty exists about which Ganoderma species was most widely utilized as lingzhi mushroom in ancient times, and likely a few different common species were considered interchangeable.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["Wood", "Forest Floor", "Cultivated"],
       "image1": "https://en.wikipedia.org/wiki/Lingzhi_(mushroom)#/media/File:Ganoderma_lucidum_01.jpg",
       "image2": "https://en.wikipedia.org/wiki/Lingzhi_(mushroom)#/media/File:Jreishi2.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Lingzhi_(mushroom)",
       "category":"choice"

   },
   {
       "id": 1032,
       "name": "The Sickener",
       "scientificName": "Russula emetica",
       "edible": "Poisonous",
       "gourmet": "Not Choice",
       "family": "Russulaceae",
       "description": "Russula emetica, commonly known as the sickener, emetic russula, or vomiting russula, is a basidiomycete mushroom, and the type species of the genus Russula. The mushroom's common names refer to the gastrointestinal distress they cause when consumed raw. The flesh is extremely peppery, but this offensive taste, along with its toxicity, can be removed by parboiling or pickling. Although it used to be widely eaten in Russia and eastern European countries, it is generally not recommended for consumption.",
       "appearance": " It has a red, convex to flat cap up to 8.5 cm (3.3 in) in diameter, with a cuticle that can be peeled off almost to the centre. The gills are white to pale cream, and closely spaced. A smooth white stem measures up to 10.5 cm (4.1 in) long and 2.4 cm (0.9 in) thick. First described in 1774, the mushroom has a wide distribution in the Northern Hemisphere, where it grows on the ground in damp woodlands in a mycorrhizal association with conifers, especially pine.",
       "imageName": "the-sickener1",
       "funFact": "There are many similar Russula species that have a red cap with white stem and gills, some of which can be reliably distinguished from R. emetica only by microscopic characteristics.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/Russula_emetica#/media/File:Russula_emetica_in_Poland.jpg",
       "image2": "https://en.wikipedia.org/wiki/Russula_emetica#/media/File:Tiny_Russula_paludosa_(Appelrussula)_at_Rozendaal_castle_park_-_panoramio.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Russula_emetica",
       "category":"poisonous"

   },
   {
       "id": 1033,
       "name": "Shaggy Mane",
       "scientificName": "Coprinus comatus",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Agaricaceae",
       "description": "Coprinus comatus, the shaggy ink cap, lawyer's wig, or shaggy mane, is a common fungus often seen growing on lawns, along gravel roads and waste areas. When young it is an excellent edible mushroom provided that it is eaten soon after being collected (it keeps very badly because of the autodigestion of its gills and cap). If long-term storage is desired, microwaving, sauteing or simmering until limp will allow the mushrooms to be stored in a refrigerator for several days or frozen. Also, placing the mushrooms in a glass of ice water will delay the decomposition for a day or two so that one has time to incorporate them into a meal. Processing or icing must be done whether for eating or storage within four to six hours of harvest to prevent undesirable changes to the mushroom. The species is cultivated in China as food.",
       "appearance": "The young fruit bodies first appear as white cylinders emerging from the ground, then the bell-shaped caps open out. The caps are white, and covered with scales—this is the origin of the common names of the fungus. The gills beneath the cap are white, then pink, then turn black and secrete a black liquid filled with spores (hence the 'ink cap' name). This mushroom is unusual because it will turn black and dissolve itself in a matter of hours after being picked or depositing spores.",
       "imageName": "shaggy-mane1",
       "funFact": "The mushroom can sometimes be confused with the magpie fungus which is poisonous. In America, the 'vomiter' mushroom Chlorophyllum molybdites is responsible for most cases of mushroom poisoning due to its similarity with shaggy mane and other edible mushrooms.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["Grass", "Forest Floor", ""],
       "image1": "https://en.wikipedia.org/wiki/Coprinus_comatus#/media/File:Coprinus_comatus_G4.JPG",
       "image2": "https://en.wikipedia.org/wiki/Coprinus_comatus#/media/File:Coprinus_comatus-2_hg.jpg",
       "wiki": "https://en.wikipedia.org/wiki/Coprinus_comatus",
       "category":"choice"

   }
   

]
