[
   {
       "id": 1001,
       "name": "Oyster Mushroom",
       "scientificName": "Pleurotus ostreatus",
       "edible": "Edible",
       "gourmet": "Choice Gourmet",
       "family": "Pleurotus ostreatus",
       "description": "Pleurotus djamor, commonly known as the pink oyster mushroom, is a species of fungus in the family Pleurotaceae. It was originally named Agaricus djamor by the German-born botanist Georg Eberhard Rumphius and sanctioned under that name by Elias Magnus Fries in 1821.",
       "appearance": "The pink oyster mushroom, unsurprisingly has a pink color. When cooked, however, the color quickly fades. It has a curly cap which is 2 – 5 cm in diameter. The caps are also quite thin.",
       "imageName": "pinkOyster",
       "funFact": "The pink oyster is pink :o",
       "lookalikes": "none",
       "growable" : true,
       "locations" : ["Wood", "", ""],
       "sources": "https://gallowaywildfoods.com/oyster-mushroom-edibility-identification-distribution/",
       "resources": "https://www.foragesf.com/blog/2019/10/25/tips-on-how-to-find-and-cook-wild-oyster-mushrooms",
       "wiki": "https://en.wikipedia.org/wiki/Pleurotus",
       "category":"edible"

   },
   {
       "id": 1002,
       "name": "Shiitake Mushroom",
       "scientificName": "Lentinula edodes",
       "edible": "Edible",
       "gourmet": "Choice Gourmet",
       "family": "Marasmiaceae",
       "description": "The shiitake is an edible mushroom native to East Asia, which is cultivated and consumed in many East Asian countries. It is considered a medicinal mushroom in some forms of traditional medicine.",
       "appearance": "Shiitake mushrooms are small to medium in size with caps averaging 10-20 centimeters in diameter and are attached to thin stems. The caps range in color from light to dark brown and have a wide, umbrella shape with a characteristic curled rim. Inside, the cream-colored flesh is firm, chewy, and spongy.",
       "imageName": "shiitake",
       "funFact": "The shiitake is brown :o",
       "lookalikes": "none",
       "growable" : true,
       "locations" : ["Wood", "Cultivated", ""],
       "sources": "http://www.polarshiitake.com/en/shiitakemushroom",
       "resources": "https://growyourpantry.com/blogs/mushroom-guides/shiitake-mushrooms-your-complete-guide",
       "wiki": "https://en.wikipedia.org/wiki/Shiitake",
       "category":"edible"

   },
   {
       "id": 1003,
       "name": "Shrimp of the woods",
       "scientificName": "Entoloma abortivum",
       "edible": "Edible",
       "gourmet": "Choice Gourmet",
       "family": "Entolomataceae",
       "description": "Entoloma abortivum, commonly known as the aborted entoloma or shrimp of the woods, is an edible mushroom in the Entolomataceae family of fungi. Caution should be used in identifying the species before eating. First named Clitopilus abortivus by Miles Joseph Berkeley and Moses Ashley Curtis, it was given its current name by the Dutch mycologist Marinus Anton Donk in 1949.",
       "appearance": "Need data",
       "imageName": "grayMUSHROOM",
       "funFact": "It was believed that the honey mushroom, Armillaria mellea, was parasitizing the entoloma. But research has indicated that the inverse may be true—the entoloma may be parasitizing the honey mushroom. There is still some disagreement by mushroom collectors about this since it is common to see both the aborted and unaborted forms of the entoloma on wood and in leaf litter, whereas Armillaria generally only fruits on wood. Both versions of the entoloma have also been observed when there are no Armillaria fruiting.",
       "lookalikes": "none",
       "growable" : false,
       "locations" : ["", "", ""],
       "sources": "",
       "resources": "",
       "wiki": "https://en.wikipedia.org/wiki/Entoloma_abortivum",
       "category":"edible"

   },
   {
       "id": 1004,
       "name": "Artist's Conk",
       "scientificName": "Ganoderma Applanatum",
       "edible": "Not Edible",
       "gourmet": "Not Choice",
       "family": "Ganodermataceae",
       "description": "Ganoderma applanatum is a wood-decay fungus, causing a rot of heartwood in a variety of trees. It can also grow as a pathogen of live sapwood, particularly on older trees that are sufficiently wet. It is a common cause of decay and death of beech and poplar, and less often of several other tree genera, including alder, apple, elm, buckeye and horse chestnut, maple, oak, walnut, willow, western hemlock, Douglas fir, old or sick olive tree and spruce. A peculiarity of this fungus lies in its use as a drawing medium for artists. When the fresh white pore surface is rubbed or scratched with a sharp implement, dark brown tissue under the pores is revealed, resulting in visible lines and shading that become permanent once the fungus is dried.",
       "appearance": "This fungus grows as a mycelium within the wood of living and dead trees. It forms fruiting bodies that are 3–30 cm wide × 5–50 cm long × 1–10 cm thick, hard as leather, woody-textured, and inedible. They are white at first but soon turn dark red-brown. Brown spores are released from the pores on the underside of the fruiting body. The tubes are 4-12 mm deep and terminate in pores that are round with 4-6 per millimetre. The fruiting bodies are perennial, and may persist for multiple years, increasing in size and forming new layers of pores as they grow.",
       "imageName": "artists-conk1",
       "funFact": "G. applanatum is a medicinal farming crop that is used as a flavor enhancer in Asian cuisine. G. applanatum is non-digestible in its raw form, but it is used for cooking, because of its rich mushroom flavor. Blending with filtration, or cold pressing in water, is a common method for creating ganoderma drinks. Hot herbal soups, or fermentation in lemon acid with onion is a common use for cooking with G. applanatum slices as an umami flavor enhancer in fermented foods.",
       "lookalikes": "The similar Ganoderma brownii has thicker, darker flesh, often a yellow pore surface, and larger basidiospores than G. applanatum",
       "growable" : false,
       "locations" : ["", "", ""],
       "sources": "",
       "resources": "",
       "wiki": "https://en.wikipedia.org/wiki/Ganoderma_applanatum",
       "category":"inedible"

   },
   {
       "id": 1005,
       "name": "Beech Mushroom",
       "scientificName": "Hypsizygus tessellatus",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Tricholomataceae",
       "description": "Buna shimeji (Hypsizygus tessellatus) is an edible mushroom native to East Asia. It is cultivated locally in temperate climates in Europe, North America and Australia and sold fresh in super markets. Two variations are known: Buna-shimeji (Brown Beech Mushroom), Bunapi-shimeji (White Beech Mushroom).",
       "appearance": "In nature, shimeji are gilled mushrooms that grow on wood. Most often the mushroom is found on beech trees, hence the common name, beech mushroom. They are often small and thin in appearance and popular in many nations across the world.",
       "imageName": "beech1",
       "funFact": "Being tough when raw, the Shimeji should be cooked, having a bitter taste when raw which disappears completely upon cooking. The cooked mushroom has a firm, slightly crunchy texture and a nutty flavor. Preparation makes the mushroom easier to digest. It is often eaten with stir-fried foods including wild game and seafood. It is used in soups, stews and sauces.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["", "", ""],
       "sources": "",
       "resources": "",
       "wiki": "https://en.wikipedia.org/wiki/Hypsizygus_tessellatus",
       "category":"edible"

   },
   {
       "id": 1006,
       "name": "Beefsteak Mushroom",
       "scientificName": "Fistulina hepatica",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Fistulinaceae",
       "description": "Fistulina hepatica (beefsteak fungus, also known as beefsteak polypore, ox tongue, or tongue mushroom) is an unusual bracket fungus classified in the Agaricales, that is commonly seen in Britain, but can be found in North America, Australia, North Africa, Southern Africa and the rest of Europe. As its name suggests, it looks remarkably similar to a slab of raw meat. It has been used as a meat substitute in the past, and can still be found in some French markets. It has a sour, slightly acidic taste. For eating it must be collected young and it may be tough and need long cooking.",
       "appearance": "The shape resembles a large tongue, and it is rough-surfaced with a reddish-brown colour. The spores are released from minute pores on the creamy-white underside of the fruit body. A younger Fistulina hepatica is a pinkish-red colour, and it darkens with age. It bleeds a dull red juice when cut, with the cut flesh further resembling meat. It is edible and considered choice.",
       "imageName": "beefsteak1",
       "funFact": "The species is fairly common, and can often be found on oaks and sweet chestnut, from August to the end of autumn, on either living or dead wood. It has a tendency to impart a reddish-brown stain to the living wood of oaks, creating a desirable timber type. In Australia, it can be found growing from wounds on Eucalyptus trees. It causes a brown rot on the trees which it infects.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["", "", ""],
       "sources": "",
       "resources": "",
       "wiki": "https://en.wikipedia.org/wiki/Fistulina_hepatica",
       "category":"edible"

   },
   {
       "id": 1007,
       "name": "Button Mushroom",
       "scientificName": "Agaricus bisporus",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Agaricaceae",
       "description": "Agaricus bisporus is an edible basidiomycete mushroom native to grasslands in Europe and North America. It has two color states while immature – white and brown – both of which have various names, with additional names for the mature state. A. bisporus is cultivated in more than seventy countries, and is one of the most commonly and widely consumed mushrooms in the world. This mushroom is commonly found worldwide in fields and grassy areas following rain, from late spring through to autumn, especially in association with manure. In many parts of the world it is widely collected and eaten; however, resemblance to deadly or poisonous lookalikes should be noted.",
       "appearance": "The pileus or cap of the original wild species is a pale grey-brown in color, with broad, flat scales on a paler background and fading toward the margins. It is first hemispherical in shape before flattening out with maturity, and 5–10 centimetres (2–4 inches) in diameter. The narrow, crowded gills are free and initially, pink, then red-brown and finally a dark brown with a whitish edge from the cheilocystidia.",
       "imageName": "button1",
       "funFact": "A. bisporus is now cultivated in at least seventy countries throughout the world. Global production in the early 1990s was reported to be more than 1.4 billion kilograms (1.5 million short tons), worth more than US$2 billion. In the U.S., the white button form of A. bisporus alone accounts for about 90% of mushrooms sold.",
       "lookalikes": "The common mushroom could be confused with young specimens of the deadly poisonous destroying angel (Amanita sp.), but the latter may be distinguished by their volva or cup at the base of the mushroom and pure white gills (as opposed to pinkish or brown of A. bisporus). Thus it is always important to clear away debris and examine the base of such similar mushrooms, as well as cutting open young specimens to check the gills. Furthermore, the destroying angel grows in mossy woods and lives symbiotically with spruce.A more common and less dangerous mistake is to confuse A. bisporus with Agaricus xanthodermus, an inedible mushroom found worldwide in grassy areas. A. xanthodermus has an odor reminiscent of phenol; its flesh turns yellow when bruised. This fungus causes nausea and vomiting in some people. The poisonous European species Entoloma sinuatum has a passing resemblance as well, but has yellowish gills, turning pink, and it lacks a ring.",
       "growable" : true,
       "locations" : ["", "", ""],
       "sources": "",
       "resources": "",
       "wiki": "https://en.wikipedia.org/wiki/Agaricus_bisporus",
       "category":"edible"

   },
   {
       "id": 1008,
       "name": "Cauliflower Mushroom",
       "scientificName": "Sparassis",
       "edible": "Edible",
       "gourmet": "Not Choice",
       "family": "Sparassidaceae",
       "description": "Sparassis (also known as cauliflower mushroom) is a genus of parasitic and saprobic mushrooms characterised by their unique shape and appearance. This appearance can be described as similar to a sea sponge, a brain, or a head of cauliflower, from which it has been given its popular name. They are increasingly cultivated and being sold in Korea, Japan, United States and Australia. The generic name comes from the Greek sparassein meaning to tear.",
       "appearance": "Their color can range from light brown-yellow to yellow-grey or a creamy white cauliflower colour. They are normally 10 to 25 cm tall, but can grow to be quite large, with reported cases of fruiting bodies more than half a meter tall and 14 kg in weight. Because of their unique look and size, they are unlikely to be mistaken for any poisonous/inedible mushrooms. They grow as parasites or saprobes on the roots or bases of various species of hardwoods, especially oak, and conifers, and hence are most commonly found growing close to fir, pine, oak or spruce trees.",
       "imageName": "cauliflower1",
       "funFact": "Experiments suggest that S. crispa contains chemicals which may stimulate the immune system and have anti-tumor properties.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["", "", ""],
       "sources": "",
       "resources": "",
       "wiki": "https://en.wikipedia.org/wiki/Sparassis",
       "category":"edible"

   },
   {
       "id": 1009,
       "name": "Chanterelle Mushroom",
       "scientificName": "Cantharellus",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Cantharellaceae",
       "description": "Though records of chanterelles being eaten date back to the 16th century, they first gained widespread recognition as a culinary delicacy with the spreading influence of French cuisine in the 18th century, when they began appearing in palace kitchens. For many years, they remained notable for being served at the tables of nobility. Chanterelles as a group are generally described as being rich in flavor, with a distinctive taste and aroma difficult to characterize. Some species have a fruity odor, others a more woody, earthy fragrance, and still others can even be considered spicy. The golden chanterelle is perhaps the most sought-after and flavorful chanterelle, and many chefs consider it on the same short list of gourmet fungi as truffles and morels. It therefore tends to command a high price in both restaurants and specialty stores.",
       "appearance": "They are orange, yellow or white, meaty and funnel-shaped. On the lower surface, underneath the smooth cap, most species have rounded, forked folds[1] that run almost all the way down the stipe, which tapers down seamlessly from the cap. Many species emit a fruity aroma, reminiscent of apricots, and often have a mildly peppery taste (hence its German name, Pfefferling).",
       "imageName": "chanterelle1",
       "funFact": "They tend to grow in clusters in mossy coniferous forests, but are also often found in mountainous birch forests and among grasses and low-growing herbs.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["", "", ""],
       "sources": "",
       "resources": "",
       "wiki": "https://en.wikipedia.org/wiki/Chanterelle",
       "category":"edible"

   },
   {
       "id": 1010,
       "name": "Chicken of the Woods Mushroom",
       "scientificName": "Laetiporus sulphureus",
       "edible": "Edible",
       "gourmet": "Choice",
       "family": "Polyporaceae",
       "description": "Laetiporus sulphureus is a species of bracket fungus (fungi that grow on trees) found in Europe and North America. Its common names are crab-of-the-woods, sulphur polypore, sulphur shelf, and chicken-of-the-woods. Its fruit bodies grow as striking golden-yellow shelf-like structures on tree trunks and branches. Old fruitbodies fade to pale beige or pale grey. The undersurface of the fruit body is made up of tubelike pores rather than gills. Laetiporus sulphureus is a saprophyte and occasionally a weak parasite, causing brown cubical rot in the heartwood of trees on which it grows. Unlike many bracket fungi, it is edible when young, although adverse reactions have been reported.",
       "appearance": "The fruiting body emerges directly from the trunk of a tree and is initially knob-shaped, but soon expands to fan-shaped shelves, typically growing in overlapping tiers. It is sulphur-yellow to bright orange in color and has a suedelike texture. Old fruitbodies fade to tan or whitish. Each shelf may be anywhere from 5 to 60 centimetres (2 to 23 1⁄2 inches) across and up to 4 cm (1 1⁄2 in) thick. The fertile surface is sulphur-yellow with small pores or tubes and produces a white spore print. When fresh, the flesh is succulent with a strong fungal aroma and exudes a yellowish, transparent juice, but soon becomes dry and brittle.",
       "imageName": "chicken-of-the-woods1",
       "funFact": "Many people think that the mushroom tastes like crab or lobster leading to the nickname lobster-of-the-woods. It is highly regarded in Germany and North America.",
       "lookalikes": "",
       "growable" : false,
       "locations" : ["", "", ""],
       "sources": "",
       "resources": "",
       "wiki": "https://en.wikipedia.org/wiki/Laetiporus_sulphureus",
       "category":"edible"

   },
   {
       "id": 1011,
       "name": "Corn Smut",
       "scientificName": "Ustilago maydis",
       "edible": "Use Caution",
       "gourmet": "Not Choice",
       "family": "Ustilaginaceae",
       "description": "Corn smut is a plant disease caused by the pathogenic fungus Ustilago maydis that causes smut on maize and teosinte. The fungus forms galls on all above-ground parts of corn species. It is edible, and is known in Mexico as the delicacy huitlacoche; which is eaten, usually as a filling, in quesadillas and other tortilla-based foods, and in soups.",
       "appearance": "The fungus infects all parts of the host plant by invading the ovaries of its host. The infection causes the corn kernels to swell up into tumor-like galls, whose tissues, texture, and developmental pattern are mushroom-like. These galls are made up of hypertrophied cells of the infected plant, along with resulting fungal threads, and blue-black spores. These dark-colored spores give the cob a burned, scorched appearance; this is the origin of the generic name Ustilago, from the Latin word ustilare (to burn).",
       "imageName": "corn-smut2",
       "funFact": "Corn smut, while a delicacy across the world, can also have economical repercussions. Aydogdu and Boyraz found that corn exposed to corn smut resulted in a 33% yield loss. With corn being a staple crop for both animals and people, a 33% yield loss could prove disastrous to food supply. However, out of the many types of corn, sweet corn is the most affected by corn smut.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["", "", ""],
       "sources": "",
       "resources": "",
       "wiki": "https://en.wikipedia.org/wiki/Corn_smut",
       "category":"use caution"

   },
   {
       "id": 1012,
       "name": "Cordyceps",
       "scientificName": "Cordyceps militaris",
       "edible": "Use Caution",
       "gourmet": "Not Choice",
       "family": "Cordycipitaceae",
       "description": "Cordyceps militaris is a species of fungus in the family Cordycipitaceae, and the type species of the genus Cordyceps. It was originally described by Carl Linnaeus in 1753 as Clavaria militaris. It is a potential harbour of bio-metabolites for herbal drugs and evidences are available about its applications for revitalization of various systems of the body from ancient times. C. militaris can be cultivated in a variety of media including silkworm pupae, rice, or liquid nutrition. It is considered inedible in American sources, but in Asia the fruiting body is cooked as a mushroom in dishes like chicken soup.",
       "appearance": "The fungus forms 20–50 mm high, club-shaped and orange/red fruiting bodies, which grow out of dead underground pupae. The club is covered with the stroma, into which the actual fruit bodies, the perithecia, are inserted. The surface appears roughly punctured. The inner fungal tissue is whitish to pale orange.",
       "imageName": "cordyceps1",
       "funFact": "Cordyceps militaris is a entomopathogenic fungus, meaning it parasitizes insects. Many authors consider it quite common, spread throughout the northern hemisphere, and fruiting bodies appear in Europe from August to November.",
       "lookalikes": "",
       "growable" : true,
       "locations" : ["", "", ""],
       "sources": "",
       "resources": "",
       "wiki": "https://en.wikipedia.org/wiki/Cordyceps_militaris",
       "category":"use caution"

   }
   
   
]
